[
    {
        "name": "4-ZERO-3",
        "url": "https://github.com/Dheerajmadhukar/4-ZERO-3",
        "source": "https://github.com/Dheerajmadhukar/4-ZERO-3",
        "description": "403/401 Bypass Methods with Bash Automation.",
        "techniques": [
            "content_discovery"
        ],
        "categories": [
            "bypass"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "AADInternals",
        "url": "https://aadinternals.com/",
        "source": "https://github.com/Gerenios/AADInternals",
        "description": "AADInternals and AADInternals-Endpoints toolkits are PowerShell modules containing tools for administering and hacking Entra ID (ex. Azure AD), Office 365, and Entra ID related endpoints.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "active_directory"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "AdminPBuster",
        "url": "https://github.com/blackhatethicalhacking/AdminPBuster",
        "source": "https://github.com/blackhatethicalhacking/AdminPBuster",
        "description": "AdminPBuster identifies hidden admin panels for any domain using a built-in wordlist that includes both common and obscure paths, effectively bypassing WAFs.",
        "techniques": [
            "content_discovery",
            "reconnaissance"
        ],
        "categories": [],
        "targets": [
            "web"
        ]
    },
    {
        "name": "AdvPhishing",
        "url": "https://github.com/Ignitetch/AdvPhishing",
        "source": "https://github.com/Ignitetch/AdvPhishing",
        "description": "AdvPhishing is an advanced phishing tool used for creating fake login pages to steal credentials. This tool generates realistic-looking login pages for various popular websites, such as Facebook, Instagram, Twitter, and Gmail, and captures the credentials entered by victims.",
        "techniques": [
            "phishing",
            "social_engineering"
        ],
        "categories": [],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "Ahmia",
        "url": "https://ahmia.fi/",
        "source": "https://github.com/ahmia/ahmia-site",
        "description": "Ahmia is the search engine for .onion domains on the Tor anonymity network.",
        "techniques": [
            "reconnaissance",
            "footprinting"
        ],
        "categories": [
            "dark_web",
            "search_engine"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Aircrack-ng",
        "url": "https://www.aircrack-ng.org/",
        "source": "https://github.com/aircrack-ng/aircrack-ng",
        "description": "Aircrack-ng is a comprehensive suite of tools designed to assess Wi-Fi network security. It focuses on various aspects of Wi-Fi security, including monitoring (packet capture), attacking (replay attacks, deauthentication, fake access points, and other techniques using packet injection), testing (evaluating Wi-Fi card and driver capabilities for packet capture and injection), and cracking (breaking WEP and WPA-PSK encryption for WPA1 and WPA2). Key Components of Aircrack-ng Suite: Airbase-ng, Aircrack-ng, Airdecap-ng, Airdrop-ng, Aireplay-ng, Airgraph-ng, Airmon-ng, Airodump-ng, Airolib-ng, Airtun-ng.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network",
            "wireless"
        ]
    },
    {
        "name": "Airgeddon",
        "url": "https://github.com/v1s1t0r1sh3r3/airgeddon",
        "source": "https://github.com/v1s1t0r1sh3r3/airgeddon",
        "description": "Airgeddon is a powerful, multi-functional Wi-Fi auditing tool designed for penetration testing and security assessments of wireless networks. It provides an automated framework to perform various attacks, including wireless network scanning, Evil Twin attacks (rogue AP), WPA/WPA2 handshake capture and cracking, WPS attacks using Reaver, Bully, and Pixie-Dust, Denial-of-Service (DoS) attacks, and Man-in-the-Middle (MITM) attacks. Additionally, it features an automated mode for easy execution, making it accessible for both beginners and advanced users in Wi-Fi security testing.",
        "techniques": [
            "denial_of_service",
            "exploitation"
        ],
        "categories": [
            "network_scanner",
            "rogue_access_point"
        ],
        "targets": [
            "network",
            "wireless"
        ]
    },
    {
        "name": "Amass",
        "url": "https://owasp.org/www-project-amass/",
        "source": "https://github.com/owasp-amass/amass",
        "description": "The OWASP Amass Project performs network mapping of attack surfaces and external asset discovery using open-source information gathering and active reconnaissance techniques. It enables subdomain and DNS enumeration, graph-based visualization, integration with external sources, ASN and IP address mapping, scraping, and web archive analysis. These capabilities help identify subdomains, map external assets, and uncover vulnerabilities in an organization's infrastructure.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT",
            "subdomain_enum"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Androguard",
        "url": "https://androguard.readthedocs.io/",
        "source": "https://github.com/androguard/androguard",
        "description": "Androguard is a comprehensive Python-based tool designed specifically for analyzing and reverse engineering Android application files. It is compatible exclusively with Python 3 and provides extensive support for working with various Android components. These include DEX and ODEX files, APK packages, Android’s binary XML format, and Android resource files. Androguard also enables disassembly of DEX/ODEX bytecode and includes a decompiler to convert these files into a more human-readable format, making it a powerful asset for security researchers and penetration testers.",
        "techniques": [
            "forensics",
            "malware_analysis",
            "reverse_engineering"
        ],
        "categories": [
            "APK_analyzer"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "AndroRAT",
        "url": "https://attack.mitre.org/software/S0292/",
        "source": "https://github.com/karma9874/AndroRAT",
        "description": "AndroRAT is an open-source remote access tool for Android devices, designed to remotely control an Android system and extract information from it. It operates as a client-server application. AndroRAT provides a fully persistent backdoor with an invisible icon upon installation and automatically starts on boot. It enables remote access via a command-and-control (C2) server, allowing data extraction such as contacts, call logs, messages, device location, and SIM card details. Additionally, it can manipulate SMS and calls, perform keylogging, track GPS location, and manage applications by installing or uninstalling them remotely. The tool also grants unauthorized access to the microphone and camera for recording audio, capturing photos, and recording videos, along with retrieving network details like IP and MAC addresses.",
        "techniques": [
            "hijacking",
            "exploitation",
            "post_exploitation",
            "remote_code_execution"
        ],
        "categories": [
            "credential_dumping",
            "RAT"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "Angry IP Scanner",
        "url": "https://angryip.org/",
        "source": "https://github.com/angryip/ipscan",
        "description": "Angry IP Scanner (or simply ipscan) is an open-source, cross-platform network scanner that scans IP addresses, IP ranges, and ports. It is used for discovering devices on a network and gathering host information.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "port_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "APK Editor Studio",
        "url": "https://qwertycube.com/apk-editor-studio/download/",
        "source": "https://github.com/kefir500/apk-editor-studio",
        "description": "APK Editor Studio is a powerful yet easy-to-use APK reverse-engineering tool. It allows you to easily extract, edit, or replace APK resources. With APK Editor Studio, you can change the Android application icon and title, remove unwanted permissions, explore the internal structure of an app, automatically sign APK, install it on your device, and much more. Lots of handy built-in tools will cover all your needs, from making minor changes to creating full-fledged APK mods.",
        "techniques": [
            "malware_analysis",
            "reverse_engineering"
        ],
        "categories": [
            "APK_analyzer"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "Apktool",
        "url": "https://apktool.org/",
        "source": "https://github.com/iBotPeaches/Apktool",
        "description": "Apktool is a tool for reverse engineering third-party, closed, binary Android apps. It can decode resources to nearly their original form and rebuild them after modifications, enabling step-by-step debugging of smali code. It simplifies working with apps through a project-like file structure and automates repetitive tasks such as building APKs. It can disassemble, assemble, and analyze Android applications.",
        "techniques": [
            "forensics",
            "malware_analysis",
            "reverse_engineering"
        ],
        "categories": [
            "APK_analyzer"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "App Manager",
        "url": "https://muntashirakon.github.io/AppManager/",
        "source": "https://github.com/MuntashirAkon/AppManager",
        "description": "A full-featured package manager and viewer for Android.",
        "techniques": [],
        "categories": [
            "ADB"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "Arjun",
        "url": "https://github.com/s0md3v/Arjun",
        "source": "https://github.com/s0md3v/Arjun",
        "description": "Arjun can find HTTP query parameters for URL endpoints",
        "techniques": [
            "content_discovery",
            "reconnaissance"
        ],
        "categories": [
            "fuzzing"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "ARP Scan",
        "url": "https://github.com/royhills/arp-scan",
        "source": "https://github.com/royhills/arp-scan",
        "description": "ARP Scanner or arp-scan is a network scanning tool that uses the ARP protocol to discover and fingerprint IPv4 hosts on the local network.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "host_discovery",
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Assetfinder",
        "url": "https://github.com/tomnomnom/assetfinder",
        "source": "https://github.com/tomnomnom/assetfinder",
        "description": "Find domains and subdomains potentially related to a given domain.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT",
            "subdomain_enum"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Autopsy",
        "url": "https://www.autopsy.com/",
        "source": "https://www.sleuthkit.org/autopsy/",
        "description": "Autopsy is a free, open-source digital forensics tool that provides a user-friendly interface for analyzing hard drives, smartphones, and other digital evidence. Built on The Sleuth Kit, it helps investigators recover deleted files, analyze browser history, extract metadata, and create activity timelines, making it widely used in cybercrime investigations, law enforcement, and cybersecurity.",
        "techniques": [
            "forensics"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "files",
            "hardware"
        ]
    },
    {
        "name": "AWS Recon",
        "url": "https://github.com/joshlarsen/aws-recon",
        "source": "https://github.com/joshlarsen/aws-recon",
        "description": "Multi-threaded AWS inventory collection tool with a focus on security-relevant resources and metadata. This tool was created to facilitate efficient collection of a large amount of AWS resource attributes and metadata. It aims to collect nearly everything that is relevant to the security configuration and posture of an AWS environment.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "AzureADRecon",
        "url": "https://github.com/adrecon/AzureADRecon",
        "source": "https://github.com/adrecon/AzureADRecon",
        "description": "AzureADRecon is a tool which extracts and combines various artefacts (as highlighted below) out of an Azure AD environment with a valid credential. The information can be presented in a specially formatted Microsoft Excel report that includes summary views with metrics to facilitate analysis and provide a holistic picture of the current state of the target environment.",
        "techniques": [
            "enumeration"
        ],
        "categories": [
            "active_directory"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "BeEF",
        "url": "https://beefproject.com/",
        "source": "https://github.com/beefproject/beef",
        "description": "BeEF is short for The Browser Exploitation Framework. It is a penetration testing tool that focuses on the web browser. Amid growing concerns about web-borne attacks against clients, including mobile clients, BeEF allows the professional penetration tester to assess the actual security posture of a target environment by using client-side attack vectors.",
        "techniques": [
            "exploitation",
            "social_engineering"
        ],
        "categories": [
            "browser",
            "OSINT"
        ],
        "targets": [
            "files",
            "hardware"
        ]
    },
    {
        "name": "Beheader",
        "url": "https://github.com/p2r3/beheader",
        "source": "https://github.com/p2r3/beheader",
        "description": "Polyglot generator for media files.",
        "techniques": [
            "malware_analysis",
            "steganography"
        ],
        "categories": [
            "polyglot"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "Bettercap",
        "url": "https://www.bettercap.org/",
        "source": "https://github.com/bettercap/bettercap",
        "description": "The Swiss Army knife for WiFi, Bluetooth Low Energy, wireless HID hijacking, CAN-bus and IPv4 and IPv6 networks reconnaissance and MITM attacks. WiFi scanning, deauthentication and PMKID attacks, and automatic WPA/WPA2 handshake capture; Bluetooth Low Energy scanning, characteristics enumeration, and data read/write; 2.4GHz device scanning and MouseJacking attacks with HID frame injection (DuckyScript support); passive and active IP probing; ARP, DNS, DHCPv6, and NDP spoofing for MITM on IPv4/IPv6; scriptable proxies at packet, TCP, and HTTP/HTTPS levels; a network sniffer for credential harvesting and protocol fuzzing; a fast port scanner; and CAN-bus support for reading, injecting, fuzzing, DBC loading, and OBD2 PIDs parsing.",
        "techniques": [
            "enumeration",
            "exploitation",
            "hijacking",
            "reconnaissance",
            "sniffing",
            "spoofing"
        ],
        "categories": [
            "credential_dumping",
            "fuzzing",
            "network_scanner",
            "port_scanner"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "BillCipher",
        "url": "https://githacktools.blogspot.com/",
        "source": "https://github.com/bahatiphill/BillCipher",
        "description": "Information gathering tool for websites and IP addresses. It retrieves data such as DNS records, WHOIS details, GeoIP, subnet information, port scanning results, page links, zone transfers, HTTP headers, host discovery, IP location, shared DNS records, robots.txt, reverse IP lookup, email discovery, subdomains, admin login detection, Cloudflare bypass techniques, website copying, and host details.",
        "techniques": [
            "footprinting",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "header_analysis",
            "host_discovery",
            "network_scanner",
            "OSINT",
            "port_scanner",
            "subdomain_enum"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Binwalk",
        "url": "https://github.com/ReFirmLabs/binwalk",
        "source": "https://github.com/ReFirmLabs/binwalk",
        "description": "Binwalk can identify, and optionally extract, files and data that have been embedded inside of other files. While its primary focus is firmware analysis, it supports a wide variety of file and data types.",
        "techniques": [
            "forensics",
            "malware_analysis",
            "reverse_engineering",
            "steganography"
        ],
        "categories": [
            "exfiltration"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "BloodHound",
        "url": "https://bloodhoundenterprise.io/",
        "source": "https://github.com/SpecterOps/BloodHound",
        "description": "BloodHound uses graph theory to reveal hidden and often unintended relationships within Active Directory, Entra ID (formerly Azure AD), and Microsoft Azure IaaS. Defenders (blue teams) and attackers (red teams) use BloodHound for a deeper understanding of privileged relationships in an environment.",
        "techniques": [
            "reconnaissance",
            "post_exploitation",
            "privilege_escalation"
        ],
        "categories": [
            "active_directory"
        ],
        "targets": [
            "network",
            "windows"
        ]
    },
    {
        "name": "Broken Phone Recovery",
        "url": "https://github.com/v1nc/Broken-Phone-Recovery",
        "source": "https://github.com/v1nc/Broken-Phone-Recovery",
        "description": "A guide how to backup data from your locked android phone if you broke your screen (and more)",
        "techniques": [
            "forensics"
        ],
        "categories": [],
        "targets": [
            "android",
            "hardware"
        ]
    },
    {
        "name": "BrutDroid",
        "url": "https://github.com/Brut-Security/BrutDroid",
        "source": "https://github.com/Brut-Security/BrutDroid",
        "description": "BrutDroid 2.0 is a powerful, Windows-optimized toolkit designed specifically for Android Studio, streamlining the setup of a mobile penetration testing lab. Built to make Android pentesting effortless, it automates emulator creation, rooting, Frida server setup, and Burp Suite certificate installation.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "root"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "Bucket Flaws",
        "url": "https://github.com/nikhil1232/Bucket-Flaws",
        "source": "https://github.com/nikhil1232/Bucket-Flaws",
        "description": "Bucket Flaws (S3 Bucket Mass Scanner) is a simple, lightweight script that takes a list of bucket names and checks for common S3 bucket misconfigurations.",
        "techniques": [
            "enumeration"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "BucketLoot",
        "url": "https://github.com/redhuntlabs/BucketLoot",
        "source": "https://github.com/redhuntlabs/BucketLoot",
        "description": "BucketLoot is an automated S3-compatible Bucket inspector that can help users extract assets, flag secret exposures and even search for custom keywords as well as Regular Expressions from publicly-exposed storage buckets by scanning files that store data in plain-text.",
        "techniques": [
            "enumeration"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Bug Bounty Helper",
        "url": "https://dorks.faisalahmed.me/",
        "source": "https://dorks.faisalahmed.me/",
        "description": "Google Dorks",
        "techniques": [
            "content_discovery",
            "reconnaissance"
        ],
        "categories": [
            "dorks",
            "OSINT",
            "search_engine",
            "web_app"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Bug-Bounty-Search-Engine",
        "url": "https://nitinyadav00.github.io/Bug-Bounty-Search-Engine/",
        "source": "https://github.com/NitinYadav00/Bug-Bounty-Search-Engine",
        "description": "Search Engine For Bug Bounty Hunters",
        "techniques": [
            "content_discovery",
            "reconnaissance"
        ],
        "categories": [
            "dorks",
            "OSINT",
            "search_engine",
            "web_app"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Burp Suite",
        "url": "https://portswigger.net/",
        "source": "https://github.com/PortSwigger",
        "description": "Burp Suite is a Java-based web application vulnerability scanner and penetration testing framework, allowing for the interception and manipulation of HTTP/HTTPS traffic between a browser and server.",
        "techniques": [
            "HTTP_tampering"
        ],
        "categories": [
            "fuzzing"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Bytecode Viewer",
        "url": "https://bytecodeviewer.com/",
        "source": "https://github.com/Konloch/bytecode-viewer",
        "description": "Bytecode Viewer - a lightweight user-friendly Java/Android Bytecode Viewer, Decompiler & More.",
        "techniques": [
            "reverse_engineering"
        ],
        "categories": [
            "APK_analyzer"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "CamOver",
        "url": "https://entysec.com/",
        "source": "https://github.com/EntySec/CamOver",
        "description": "CamOver is a camera exploitation tool designed to disclose network camera admin passwords. It exploits vulnerabilities in popular camera models such as CCTV, GoAhead, and Netwave. The tool is optimized for efficiency, allowing users to target multiple cameras simultaneously using threading.",
        "techniques": [
            "exploitation",
            "hijacking"
        ],
        "categories": [],
        "targets": [
            "hardware",
            "network"
        ]
    },
    {
        "name": "CamPhish",
        "url": "https://github.com/techchipnet/CamPhish",
        "source": "https://github.com/techchipnet/CamPhish",
        "description": "CamPhish is a technique used to capture cam shots from a target's phone front camera or PC webcam. It hosts a fake website on an in-built PHP server and utilizes Ngrok and Cloudflare Tunnel to generate a shareable link, allowing access over the internet. When the target opens the link, the website requests camera permissions, and if granted, the tool captures cam shots from the target's device. Additionally, it can obtain GPS location data, all by simply sending a link.",
        "techniques": [
            "hijacking",
            "phishing",
            "social_engineering"
        ],
        "categories": [],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "Censys",
        "url": "https://search.censys.io/",
        "source": "https://github.com/censys/censys-python",
        "description": "Censys is a cybersecurity tool and search engine that scans the internet to collect and analyze publicly available data about hosts, networks, and devices. It provides insights into open ports, services, SSL/TLS certificates, web servers, IoT devices, cloud services, domains, subdomains, hosts, infrastructure, and the technologies used by a website.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "search_engine",
            "web_app"
        ],
        "targets": [
            "IoT",
            "network",
            "web"
        ]
    },
    {
        "name": "CeWL",
        "url": "https://digi.ninja/projects/cewl.php",
        "source": "https://github.com/digininja/CeWL",
        "description": "CeWL (Custom Word List generator) is a tool used for creating wordlists by crawling a specified URL and extracting words from it. It is used to create custom wordlists for password cracking or dictionary attacks. It can scan web pages recursively to gather more words and extract metadata from documents like PDFs and Office files.",
        "techniques": [
            "password_attack"
        ],
        "categories": [
            "wordlists"
        ],
        "targets": []
    },
    {
        "name": "Cloud Container Attack Tool (CCAT)",
        "url": "https://rhinosecuritylabs.com/aws/cloud-container-attack-tool/",
        "source": "https://github.com/RhinoSecurityLabs/ccat",
        "description": "Cloud Container Attack Tool (CCAT) is a tool for testing security of container environments.",
        "techniques": [
            "enumeration",
            "exploitation"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Cloud_enum",
        "url": "https://github.com/initstring/cloud_enum",
        "source": "https://github.com/initstring/cloud_enum",
        "description": "Multi-cloud OSINT tool. Enumerate public resources in AWS, Azure, and Google Cloud.",
        "techniques": [
            "enumeration"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "CloudBrute",
        "url": "https://github.com/0xsha/CloudBrute",
        "source": "https://github.com/0xsha/CloudBrute",
        "description": "A tool to find a company (target) infrastructure, files, and apps on the top cloud providers (Amazon, Google, Microsoft, DigitalOcean, Alibaba, Vultr, Linode). The outcome is useful for bug bounty hunters, red teamers, and penetration testers alike.",
        "techniques": [
            "enumeration"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "CloudFox",
        "url": "https://bishopfox.com/tools/cloudfox-tool",
        "source": "https://github.com/BishopFox/cloudfox",
        "description": "A collection of enumeration commands that illuminate attack paths for cloud penetration testing. CloudFox helps you gain situational awareness in unfamiliar cloud environments. It’s an open source command line tool created to help penetration testers and other offensive security professionals find exploitable attack paths in cloud infrastructure.",
        "techniques": [
            "enumeration"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Cloudlist",
        "url": "https://projectdiscovery.io/",
        "source": "https://github.com/projectdiscovery/cloudlist",
        "description": "Cloudlist is a multi-cloud tool for getting Assets from Cloud Providers. Cloudlist is designed for the blue team to augment Attack Surface Management efforts by maintaining a centralized list of assets across multiple clouds with very little configuration efforts.",
        "techniques": [
            "enumeration"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Cloudsplaining",
        "url": "https://cloudsplaining.readthedocs.io/",
        "source": "https://github.com/salesforce/cloudsplaining",
        "description": "Cloudsplaining is an AWS IAM security assessment tool that identifies violations of the principle of least privilege and generates a risk-prioritized HTML report. It can analyze all IAM policies in your AWS account or a single policy file. The tool produces an easy-to-read HTML report along with a triage worksheet for efficient policy review.",
        "techniques": [
            "enumeration"
        ],
        "categories": [
            "misconfigs"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "CloudSploit",
        "url": "https://www.aquasec.com/",
        "source": "https://github.com/aquasecurity/cloudsploit",
        "description": "CloudSploit by Aqua is an open-source project designed to allow detection of security risks in cloud infrastructure accounts, including: Amazon Web Services (AWS), Microsoft Azure, Google Cloud Platform (GCP), Oracle Cloud Infrastructure (OCI), and GitHub. These scripts are designed to return a series of potential misconfigurations and security risks.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "misconfigs"
        ],
        "targets": [
            "cloud",
            "web"
        ]
    },
    {
        "name": "CmosPwd",
        "url": "https://www.cgsecurity.org/",
        "source": "https://www.cgsecurity.org/wiki/CmosPwd",
        "description": "CmosPwd is an open-source tool used to decrypt, recover, or reset BIOS/CMOS passwords and reset BIOS settings on various computer systems. It can also back up, restore, and erase/kill CMOS.",
        "techniques": [
            "forensics",
            "password_attack"
        ],
        "categories": [
            "credential_dumping"
        ],
        "targets": [
            "hardware"
        ]
    },
    {
        "name": "CORScanner",
        "url": "https://github.com/chenjj/CORScanner",
        "source": "https://github.com/chenjj/CORScanner",
        "description": "CORScanner is a python tool designed to discover CORS misconfigurations vulnerabilities of websites. It helps website administrators and penetration testers to check whether the domains/urls they are targeting have insecure CORS policies.",
        "techniques": [
            "CORS",
            "vulnerability_assessment"
        ],
        "categories": [
            "misconfigs",
            "vulnerability_scanner"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Corsy",
        "url": "https://github.com/s0md3v/Corsy",
        "source": "https://github.com/s0md3v/Corsy",
        "description": "Corsy is a lightweight program that scans for all known misconfigurations in CORS implementations.",
        "techniques": [
            "CORS",
            "vulnerability_assessment"
        ],
        "categories": [
            "misconfigs",
            "vulnerability_scanner"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "CrackStation",
        "url": "https://crackstation.net/",
        "source": "https://crackstation.net/",
        "description": "CrackStation uses massive pre-computed lookup tables to crack password hashes. These tables store a mapping between the hash of a password, and the correct password for that hash. The hash values are indexed so that it is possible to quickly search the database for a given hash. If the hash is present in the database, the password can be recovered in a fraction of a second.",
        "techniques": [
            "password_attack"
        ],
        "categories": [
            "hash",
            "web_app"
        ],
        "targets": []
    },
    {
        "name": "CrossLinked",
        "url": "https://github.com/m8sec/CrossLinked",
        "source": "https://github.com/m8sec/CrossLinked",
        "description": "CrossLinked is a LinkedIn enumeration tool that uses search engine scraping to collect valid employee names from an organization. This technique provides accurate results without the use of API keys, credentials, or accessing LinkedIn directly.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "cURL",
        "url": "https://curl.se/",
        "source": "https://github.com/curl/curl",
        "description": "cURL (short for Client URL) is a command-line tool used to transfer data to or from a server using various protocols such as HTTP, HTTPS, and FTP; in cybersecurity, it is commonly used for reconnaissance, bypassing security controls, and testing web application endpoints.",
        "techniques": [
            "enumeration",
            "HTTP_tampering",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "WAF_detection",
            "website_mirroring"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "CyberChef",
        "url": "https://gchq.github.io/CyberChef/",
        "source": "https://github.com/gchq/CyberChef",
        "description": "CyberChef is a simple, intuitive web app for carrying out all manner of \"cyber\" operations within a web browser. These operations include simple encoding like XOR and Base64, more complex encryption like AES, DES and Blowfish, creating binary and hexdumps, compression and decompression of data, calculating hashes and checksums, IPv6 and X.509 parsing, changing character encodings, and much more.",
        "techniques": [
            "cryptography",
            "forensics",
            "steganography"
        ],
        "categories": [
            "web_app"
        ],
        "targets": []
    },
    {
        "name": "Cycript",
        "url": "https://www.cycript.org/",
        "source": "https://www.cycript.org/",
        "description": "Cycript allows developers to explore and modify running applications on iOS or macOS using a hybrid of Objective-C++ and JavaScript syntax through an interactive console featuring syntax highlighting and tab completion. (It also runs standalone on Android and Linux, providing access to Java but without injection.)",
        "techniques": [
            "reverse_engineering"
        ],
        "categories": [],
        "targets": [
            "iOS",
            "mac"
        ]
    },
    {
        "name": "Dalfox",
        "url": "https://dalfox.hahwul.com/",
        "source": "https://github.com/hahwul/dalfox",
        "description": "Dalfox is a powerful open-source tool that focuses on automation, making it ideal for quickly scanning for XSS flaws and analyzing parameters. Its advanced testing engine and niche features are designed to streamline the process of detecting and verifying vulnerabilities.",
        "techniques": [
            "exploitation",
            "vulnerability_assessment",
            "XSS"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Damn Small SQLi Scanner",
        "url": "https://github.com/stamparm/DSSS",
        "source": "https://github.com/stamparm/DSSS",
        "description": "Damn Small SQLi Scanner (DSSS) is a fully functional SQL injection vulnerability scanner (supporting GET and POST parameters).",
        "techniques": [
            "exploitation",
            "SQL_injection",
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "database",
            "network",
            "web"
        ]
    },
    {
        "name": "dCode's Tools List",
        "url": "https://www.dcode.fr/tools-list",
        "source": "https://www.dcode.fr/tools-list",
        "description": "dCode.fr is a collection of over 900 tools to help solve games, riddles, ciphers, mathematics, puzzles, etc.",
        "techniques": [
            "cryptography"
        ],
        "categories": [
            "hash",
            "web_app"
        ],
        "targets": []
    },
    {
        "name": "DeepFind.Me",
        "url": "https://www.deepfind.me/",
        "source": "https://www.deepfind.me/",
        "description": "Depix is a PoC for a technique to recover plaintext from pixelized screenshots.",
        "techniques": [
            "enumeration",
            "reconnaissance",
            "footprinting"
        ],
        "categories": [
            "dark_web",
            "network_scanner",
            "OSINT",
            "subdomain_enum",
            "web_app"
        ],
        "targets": [
            "files",
            "network",
            "people",
            "web"
        ]
    },
    {
        "name": "Defpass",
        "url": "https://defpass.com/",
        "source": "https://defpass.com/",
        "description": "IoT Device Default Password Lookup",
        "techniques": [
            "password_attack"
        ],
        "categories": [
            "web_app"
        ],
        "targets": [
            "hardware",
            "IoT"
        ]
    },
    {
        "name": "Depix",
        "url": "https://github.com/spipm/Depixelization_poc",
        "source": "https://github.com/spipm/Depixelization_poc",
        "description": "Depix is a PoC for a technique to recover plaintext from pixelized screenshots.",
        "techniques": [
            "forensics",
            "reverse_engineering"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "Detect It Easy (DiE)",
        "url": "https://horsicq.github.io/",
        "source": "https://github.com/horsicq/Detect-It-Easy",
        "description": "Detect It Easy (DiE) is a powerful tool for file type identification, popular among malware analysts, cybersecurity experts, and reverse engineers worldwide. Supporting both signature-based and heuristic analysis, DiE enables efficient file inspections across a broad range of platforms.",
        "techniques": [
            "forensics",
            "malware_analysis",
            "reverse_engineering",
            "steganography"
        ],
        "categories": [
            "exfiltration"
        ],
        "targets": [
            "android",
            "files"
        ]
    },
    {
        "name": "Dig",
        "url": "https://www.isc.org/",
        "source": "https://www.isc.org/bind/",
        "description": "Domain Information Groper is a network administration tool used for querying the Domain Name System (DNS).",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "DIRB",
        "url": "https://dirb.sourceforge.net/",
        "source": "https://dirb.sourceforge.net/",
        "description": "DIRB (Directory Buster) is a web content scanner used for brute-forcing directories and files on web servers. It searches for existing and hidden web objects by launching a dictionary-based attack against a web server and analyzing the responses. It helps discover hidden web directories and files that are not normally visible or indexed.",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fuzzing"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Dirsearch",
        "url": "https://github.com/maurosoria/dirsearch/",
        "source": "https://github.com/maurosoria/dirsearch",
        "description": "DIRB (Directory Buster) is a web content scanner used for brute-forcing directories and files on web servers. It searches for existing and hidden web objects by launching a dictionary-based attack against a web server and analyzing the responses. It helps discover hidden web directories and files that are not normally visible or indexed.",
        "techniques": [
            "content_discovery",
            "reconnaissance"
        ],
        "categories": [
            "fuzzing"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "DNSDumpster.com",
        "url": "https://dnsdumpster.com/",
        "source": "https://dnsdumpster.com/",
        "description": "A free online DNS reconnaissance and research tool that helps gather information about a domain’s infrastructure. It is used for network reconnaissance, including subdomain enumeration, DNS records lookup, IP and host mapping, reverse DNS lookup, geolocation, and WHOIS data.",
        "techniques": [
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "web_app"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "DNSRecon",
        "url": "https://github.com/darkoperator/dnsrecon",
        "source": "https://github.com/darkoperator/dnsrecon",
        "description": "DNSRecon is a powerful DNS enumeration tool, supporting zone transfer checks, general record enumeration (MX, SOA, NS, A, AAAA, SPF, TXT), SRV record discovery, TLD expansion, and wildcard resolution detection. It can brute-force subdomains, perform PTR lookups for IP ranges, and check DNS server caches for A, AAAA, and CNAME records.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "subdomain_enum"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Docem",
        "url": "https://github.com/whitel1st/docem",
        "source": "https://github.com/whitel1st/docem",
        "description": "A tool to embed XXE and XSS payloads in docx, odt, pptx, xlsx files (oxml_xxe on steroids)",
        "techniques": [
            "XSS"
        ],
        "categories": [
            "payload"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "Domain Dossier",
        "url": "https://centralops.net/co/",
        "source": "https://centralops.net/co/",
        "description": "Domain Dossier is an online tool for gathering domain and IP intelligence. It provides WHOIS data, DNS records, IP details, traceroute analysis, and blacklist checks.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Drozer",
        "url": "https://labs.withsecure.com/tools/drozer",
        "source": "https://github.com/WithSecureLabs/drozer",
        "description": "Drozer is an open-source security assessment framework for the Android platform. It helps identify vulnerabilities in apps and devices by interacting with the Android Runtime, other apps' IPC endpoints, and the underlying operating system. Drozer also provides tools to analyze and utilize public Android exploits. It can perform actions similar to an installed application, such as leveraging Android’s Inter-Process Communication (IPC) mechanism. Its key features include Application Attack Surface Analysis, Privilege Escalation, Exploit Misconfigurations, Reverse Engineering, and Remote Exploitation.",
        "techniques": [
            "reverse_engineering"
        ],
        "categories": [
            "APK_analyzer"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "E-TOOL",
        "url": "https://github.com/Expert-Hacker/E-TOOL",
        "source": "https://github.com/Expert-Hacker/E-TOOL",
        "description": "E-TOOL is a tool that can capture microphone voice notes and retrieve photos from a victim's phone. It works on both rooted and non-rooted Android devices.",
        "techniques": [
            "hijacking"
        ],
        "categories": [],
        "targets": [
            "android",
            "hardware"
        ]
    },
    {
        "name": "Enum4linux",
        "url": "https://labs.portcullis.co.uk/tools/enum4linux/",
        "source": "https://centralops.net/co/",
        "description": "Enum4linux is a Linux-based tool used for enumerating information from Windows systems, particularly those running SMB services. It provides various enumeration capabilities, including user enumeration, share enumeration, group enumeration, OS detection, password policy retrieval, RID cycling, and SAM dumping.",
        "techniques": [
            "enumeration"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network",
            "windows"
        ]
    },
    {
        "name": "EAPHammer",
        "url": "https://github.com/s0lst1c3/eaphammer",
        "source": "https://github.com/s0lst1c3/eaphammer",
        "description": "EAPHammer is a toolkit for performing targeted evil twin attacks against WPA2-Enterprise networks. Indirect wireless pivots using hostile portal attacks. It automates evil twin and credential harvesting attacks against 802.1X networks, including Evil Twin attacks on WPA2-EAP (Enterprise), MSCHAPv2 credential theft, automated Hostapd setup, captive portal attacks, support for both 2.4GHz and 5GHz frequencies, and Man-in-the-Middle (MITM) capabilities.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "credential_dumping",
            "rogue_access_point"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network"
        ]
    },
    {
        "name": "Ettercap",
        "url": "https://www.ettercap-project.org/",
        "source": "https://github.com/Ettercap/ettercap",
        "description": "Ettercap is a comprehensive suite for man-in-the-middle (MITM) attacks. It features live connection sniffing, real-time content filtering, and various advanced network manipulation techniques. It supports both active and passive protocol dissection and offers numerous tools for network and host analysis. Commonly used for network security testing and penetration testing to identify vulnerabilities in both wired and wireless networks. Key features include MITM attacks, packet sniffing, active and passive network scanning, SSL/TLS stripping, ARP spoofing, DNS spoofing, and plugin support.",
        "techniques": [
            "enumeration",
            "exploitation",
            "reconnaissance",
            "sniffing",
            "spoofing"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "ExifTool",
        "url": "https://exiftool.org/",
        "source": "https://github.com/exiftool/exiftool",
        "description": "ExifTool is a powerful command-line tool and library used for reading, writing, and editing metadata in files, especially images, videos, and documents.",
        "techniques": [
            "forensics"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "Exploit DB",
        "url": "https://www.exploit-db.com/",
        "source": "https://gitlab.com/exploit-database/exploitdb",
        "description": "The Exploit Database is a CVE compliant archive of public exploits and corresponding vulnerable software, developed for use by penetration testers and vulnerability researchers. The Exploit Database is a repository for exploits and proof-of-concepts rather than advisories, making it a valuable resource for those who need actionable data right away.",
        "techniques": [
            "enumeration",
            "exploitation",
            "reconnaissance",
            "post_exploitation",
            "vulnerability_assessment"
        ],
        "categories": [
            "OSINT",
            "vulnerability_database"
        ],
        "targets": []
    },
    {
        "name": "Fast Google Dorks Scan",
        "url": "https://github.com/IvanGlinkin/Fast-Google-Dorks-Scan",
        "source": "https://github.com/IvanGlinkin/Fast-Google-Dorks-Scan",
        "description": "The OSINT project, the main idea of which is to collect all the possible Google dorks search combinations and to find the information about the specific web-site: common admin panels, the widespread file types and path traversal. The 100% automated.",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "dorks",
            "OSINT",
            "search_engine"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Fern Wifi Cracker",
        "url": "https://github.com/savio-code/fern-wifi-cracker",
        "source": "https://github.com/savio-code/fern-wifi-cracker",
        "description": "Fern WiFi Cracker is a GUI-based wireless security auditing tool for WiFi vulnerability assessments. It automates WiFi attacks on WEP, WPA, and WPA2 networks and includes features like WEP and WPA/WPA2 cracking, deauthentication attacks, session hijacking, MITM attacks, supports external tools such as Aircrack-ng, Reaver, xHydra, and more.",
        "techniques": [
            "hijacking"
        ],
        "categories": [
            "rogue_access_point"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "Ffuf",
        "url": "https://github.com/ffuf/ffuf",
        "source": "https://github.com/ffuf/ffuf",
        "description": "Ffuf is a fast web fuzzer written in Go that allows typical directory discovery, virtual host discovery (without DNS records) and GET and POST parameter fuzzing.",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fuzzing"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Fierce",
        "url": "https://github.com/mschwager/fierce",
        "source": "https://github.com/mschwager/fierce",
        "description": "A DNS reconnaissance tool for locating non-contiguous IP space.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Fing - Network Tools",
        "url": "https://www.fing.com/",
        "source": "https://www.fing.com/",
        "description": "Fing - Network Tools is a powerful network scanning and troubleshooting app that helps users analyze and secure their home or office network. It features a network scanner, device recognition (fingerprinting), port scanner, Wi-Fi security analysis, internet speed test, and network troubleshooting tools.",
        "techniques": [
            "footprinting"
        ],
        "categories": [
            "fingerprinting",
            "network_scanner",
            "port_scanner"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "FOCA",
        "url": "https://www.elevenpaths.com/",
        "source": "https://github.com/ElevenPaths/FOCA",
        "description": "FOCA (Fingerprinting Organizations with Collected Archives) is a tool primarily used to extract metadata and hidden information from scanned documents. It can analyze documents found on web pages by downloading and processing them.",
        "techniques": [
            "forensics",
            "footprinting"
        ],
        "categories": [
            "fingerprinting"
        ],
        "targets": [
            "files",
            "web"
        ]
    },
    {
        "name": "FOFA",
        "url": "https://en.fofa.info/",
        "source": "https://en.fofa.info/",
        "description": "FOFA is a search engine for global cyberspace mapping belonging to Beijing Huashun Xin'an Technology Co., Ltd. Through continuous active detection of global Internet assets, more than 4 billion assets and more than 350,000 fingerprint rules have been accumulated, identifying most software and hardware network assets. Asset data supports external presentation and application in various ways and can perform hierarchical portraits of assets based on IP.",
        "techniques": [
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "search_engine"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Foremost",
        "url": "https://foremost.sourceforge.net/",
        "source": "https://github.com/jonstewart/foremost",
        "description": "Foremost is a console program to recover files based on their headers, footers, and internal data structures. This process is commonly referred to as data carving. Foremost can work on image files, such as those generated by dd, Safeback, Encase, etc, or directly on a drive. The headers and footers can be specified by a configuration file or you can use command line switches to specify built-in file types.",
        "techniques": [
            "forensics",
            "steganography"
        ],
        "categories": [
            "exfiltration"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "FCrackZip",
        "url": "https://oldhome.schmorp.de/marc/fcrackzip.html",
        "source": "https://oldhome.schmorp.de/marc/fcrackzip.html",
        "description": "FCrackZip is a fast password cracker partly written in assembler. It is able to crack password protected zip files with brute force or dictionary based attacks, optionally testing with unzip its results. It can also crack cpmask’ed images.",
        "techniques": [
            "password_attack"
        ],
        "categories": [],
        "targets": [
            "files"
        ]
    },
    {
        "name": "Frida",
        "url": "https://frida.re/",
        "source": "https://github.com/frida/frida",
        "description": "Frida is a powerful dynamic instrumentation toolkit used for reverse engineering, security research, and application debugging. It allows developers and researchers to inject JavaScript or Python code into running applications on platforms like Windows, macOS, Linux, iOS, and Android. Frida is commonly used for mobile app testing, bypassing root or jailbreak detection, reverse engineering, and cybersecurity research.",
        "techniques": [
            "reverse_engineering"
        ],
        "categories": [
            "APK_analyzer",
            "root"
        ],
        "targets": [
            "android",
            "iOS",
            "linux",
            "mac",
            "windows"
        ]
    },
    {
        "name": "Fsociety",
        "url": "https://github.com/Manisso/fsociety",
        "source": "https://github.com/Manisso/fsociety",
        "description": "Fsociety is an open-source hacking toolkit inspired by the TV show Mr. Robot, created by Manisso. It bundles a wide range of popular penetration testing tools for tasks like information gathering, password cracking, wireless attacks, exploitation, and web hacking—all accessible through a single Python-based interface.",
        "techniques": [
            "enumeration",
            "exploitation",
            "password_attack",
            "post_exploitation",
            "reconnaissance",
            "sniffing",
            "spoofing"
        ],
        "categories": [
            "credential_dumping",
            "network_scanner",
            "OSINT"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "GCP Scanner",
        "url": "https://github.com/google/gcp_scanner",
        "source": "https://github.com/google/gcp_scanner",
        "description": "This is a GCP resource scanner that can help determine what level of access certain credentials possess on GCP. The scanner is designed to help security engineers evaluate the impact of a certain VM/container compromise, GCP service account, or OAuth2 token key leak.",
        "techniques": [
            "enumeration"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "GCPBucketBrute",
        "url": "https://rhinosecuritylabs.com/gcp/google-cloud-platform-gcp-bucket-enumeration/",
        "source": "https://github.com/RhinoSecurityLabs/GCPBucketBrute",
        "description": "A script to enumerate Google Storage buckets, determine what access you have to them, and determine if they can be privilege escalated.",
        "techniques": [
            "enumeration"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "GetAllURLs (GAU)",
        "url": "https://github.com/lc/gau",
        "source": "https://github.com/lc/gau",
        "description": "Getallurls (gau) fetches known URLs from AlienVault's Open Threat Exchange, the Wayback Machine, Common Crawl, and URLScan for any given domain.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "GetJS",
        "url": "https://github.com/003random/getJS",
        "source": "https://github.com/003random/getJS",
        "description": "GetJS is a powerful tool for extracting JavaScript sources from URLs and web pages / HTTP responses.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "javascript",
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Ghauri",
        "url": "https://github.com/r0oth3x49/ghauri",
        "source": "https://github.com/r0oth3x49/ghauri",
        "description": "An advanced cross-platform tool that automates the process of detecting and exploiting SQL injection security flaws.",
        "techniques": [
            "exploitation",
            "SQL_injection",
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "database",
            "network",
            "web"
        ]
    },
    {
        "name": "Ghidra",
        "url": "https://ghidra-sre.org/",
        "source": "https://github.com/NationalSecurityAgency/ghidra",
        "description": "Ghidra is a software reverse engineering (SRE) framework created and maintained by the National Security Agency Research Directorate. This framework includes a suite of full-featured, high-end software analysis tools that enable users to analyze compiled code on a variety of platforms including Windows, macOS, and Linux. Capabilities include disassembly, assembly, decompilation, graphing, and scripting, along with hundreds of other features.",
        "techniques": [
            "forensics",
            "malware_analysis",
            "reverse_engineering"
        ],
        "categories": [],
        "targets": [
            "android",
            "files"
        ]
    },
    {
        "name": "Ghost",
        "url": "https://entysec.com/",
        "source": "https://github.com/EntySec/Ghost",
        "description": "Ghost Framework is an Android post-exploitation framework that exploits the Android Debug Bridge (ADB) to remotely access and control Android devices. Its key features include remote access, device control, ADB exploitation, file management, and system control.",
        "techniques": [
            "exploitation",
            "hijacking",
            "post_exploitation",
            "remote_code_execution"
        ],
        "categories": [
            "ADB",
            "RAT"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "Gnirehtet",
        "url": "https://github.com/Genymobile/gnirehtet",
        "source": "https://github.com/Genymobile/gnirehtet",
        "description": "Gnirehtet provides reverse tethering over adb for Android: it allows devices to use the internet connection of the computer they are plugged on. It does not require any root access.",
        "techniques": [],
        "categories": [
            "ADB"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "Google Maps API Scanner",
        "url": "https://github.com/ozguralp/gmapsapiscanner",
        "source": "https://github.com/ozguralp/gmapsapiscanner",
        "description": "Used for determining whether a leaked/found Google Maps API Key is vulnerable to unauthorized access by other applications or not.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "credential"
        ],
        "targets": [
            "API"
        ]
    },
    {
        "name": "Gobuster",
        "url": "https://github.com/OJ/gobuster",
        "source": "https://github.com/OJ/gobuster",
        "description": "Gobuster is a tool used to brute-force: URIs (directories and files) in web sites, DNS subdomains (with wildcard support), Virtual Host names on target web servers, Open Amazon S3 buckets, Open Google Cloud buckets, TFTP servers.",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fuzzing"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Gophish",
        "url": "https://getgophish.com/",
        "source": "https://github.com/gophish/gophish",
        "description": "Gophish is an open-source phishing toolkit designed for businesses and penetration testers. It provides the ability to quickly and easily setup and execute phishing engagements and security awareness training.",
        "techniques": [
            "phishing",
            "social_engineering"
        ],
        "categories": [],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "Google Hacking Database",
        "url": "https://www.exploit-db.com/google-hacking-database",
        "source": "https://gitlab.com/exploit-database/exploitdb",
        "description": "The Google Hacking Database (GHDB) is a categorized index of Internet search engine queries designed to uncover interesting, and usually sensitive, information made publicly available on the Internet.",
        "techniques": [
            "reconnaissance",
            "enumeration",
            "post_exploitation",
            "vulnerability_assessment"
        ],
        "categories": [
            "OSINT",
            "search_engine",
            "vulnerability_database"
        ],
        "targets": []
    },
    {
        "name": "Gospider",
        "url": "https://github.com/jaeles-project/gospider",
        "source": "https://github.com/jaeles-project/gospider",
        "description": "GoSpider is a fast, high-performance web spider written in Go that performs rapid crawling, brute-forces and parses sitemap.xml, reads robots.txt, generates and verifies links found in JavaScript files, and acts as a powerful link finder; it can discover AWS S3 buckets and subdomains from response sources and enrich its URL set using third-party and historical sources such as the Wayback Machine, Common Crawl, VirusTotal, and AlienVault.",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "crawler",
            "javascript",
            "OSINT",
            "search_engine",
            "subdomain_enum"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Grabify",
        "url": "https://grabify.link/",
        "source": "https://grabify.link/",
        "description": "Grabify IP Logger and URL Shortener helps you find and track the IP address of anyone, providing advanced and detailed statistical data and metadata for every click on your links.",
        "techniques": [
            "social_engineering"
        ],
        "categories": [
            "tracker",
            "web_app"
        ],
        "targets": [
            "people"
        ]
    },
    {
        "name": "Grep.app",
        "url": "https://grep.app/",
        "source": "https://grep.app/",
        "description": "Effortlessly search for code, files, and paths across a million GitHub repositories.",
        "techniques": [
            "reconnaissance",
            "enumeration"
        ],
        "categories": [
            "OSINT",
            "search_engine",
            "web_app"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "HACK-CAMERA",
        "url": "https://github.com/hackerxphantom/HACK-CAMERA",
        "source": "https://github.com/hackerxphantom/HACK-CAMERA",
        "description": "Hack a victim's Android camera using a link with Termux or Kali Linux. Capture IP address, location, device type, and browser information. Supports dual tunneling using Cloudflare and Ngrok for secure access.",
        "techniques": [
            "hijacking"
        ],
        "categories": [],
        "targets": [
            "android",
            "IoT",
            "hardware"
        ]
    },
    {
        "name": "Hack-Tools",
        "url": "https://github.com/LasCC/Hack-Tools",
        "source": "https://github.com/LasCC/Hack-Tools",
        "description": "HackTools, is a web extension facilitating your web application penetration tests, it includes cheat sheets as well as all the tools used during a test such as XSS payloads, Reverse shells and much more.",
        "techniques": [
            "exploitation",
            "social_engineering"
        ],
        "categories": [
            "extension",
            "reverse_shell"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "HardwareAllTheThings",
        "url": "https://swisskyrepo.github.io/HardwareAllTheThings/",
        "source": "https://github.com/swisskyrepo/HardwareAllTheThings",
        "description": "Hardware/IOT Pentesting Wiki - a curated collection of valuable payloads and bypass techniques tailored for Hardware and IoT Security",
        "techniques": [
            "exploitation",
            "malware_analysis"
        ],
        "categories": [
            "payload",
            "web_app",
            "wordlists"
        ],
        "targets": [
            "hardware",
            "IoT"
        ]
    },
    {
        "name": "Hash-identifier",
        "url": "https://github.com/blackploit/hash-identifier",
        "source": "https://github.com/blackploit/hash-identifier",
        "description": "Software to identify the different types of hashes used to encrypt data and especially passwords.",
        "techniques": [
            "password_attack"
        ],
        "categories": [
            "hash"
        ],
        "targets": []
    },
    {
        "name": "Hashcat",
        "url": "https://hashcat.net/",
        "source": "https://github.com/hashcat/hashcat",
        "description": "Hashcat is the world's fastest and most advanced password recovery utility, supporting five unique attack modes and over 300 highly optimized hashing algorithms. It runs on CPUs, GPUs, and other hardware accelerators across Linux, Windows, and macOS and includes features for distributed password cracking. Hashcat uses brute force, dictionary attacks, rule-based attacks, and GPU acceleration to crack hashes efficiently. It supports a wide range of hashing algorithms, including MD5, SHA-256, NTLM, WPA/WPA2, bcrypt, and more.",
        "techniques": [
            "cryptography",
            "password_attack"
        ],
        "categories": [
            "hash"
        ],
        "targets": []
    },
    {
        "name": "Hashes",
        "url": "https://hashes.com/",
        "source": "https://hashes.com/",
        "description": "Decrypt MD5, SHA1, MySQL, NTLM, SHA256, MD5 Email, SHA256 Email, SHA512 hashes",
        "techniques": [
            "cryptography"
        ],
        "categories": [
            "hash",
            "web_app"
        ],
        "targets": []
    },
    {
        "name": "Hcxtools",
        "url": "https://github.com/ZerBea/hcxtools",
        "source": "https://github.com/ZerBea/hcxtools",
        "description": "Hcxtools is a small set of tools designed to convert packets from capture files into hash files for use with Hashcat or John the Ripper. It is a collection of WiFi penetration testing tools that capture and analyze WPA/WPA2/WPA3 authentication handshakes for offline password cracking. Widely used in network security assessments, it supports multiple attack vectors, including PMKID attacks, hash extraction, and raw frame capturing. Key features include WPA/WPA2/WPA3 handshake capture, PMKID attack support, deauthentication and disassociation attacks, AP-less attacks, conversion tools, and support for IoT & industrial WiFi networks.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "rogue_access_point"
        ],
        "targets": [
            "network",
            "wireless"
        ]
    },
    {
        "name": "HiJackThis+",
        "url": "https://github.com/dragokas/hijackthis",
        "source": "https://github.com/dragokas/hijackthis",
        "description": "HiJackThis+ is a free utility for Microsoft Windows that scans your computer for settings changed by adware, spyware, malware and other unwanted programs. Shortly, consider it like Sysinternals Autoruns.",
        "techniques": [
            "malware_analysis"
        ],
        "categories": [
            "misconfigs"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network"
        ]
    },
    {
        "name": "Hoaxshell",
        "url": "https://github.com/t3l3machus/hoaxshell",
        "source": "https://github.com/t3l3machus/hoaxshell",
        "description": "A Windows reverse shell payload generator and handler that abuses the http(s) protocol to establish a beacon-like reverse shell.",
        "techniques": [
            "exploitation",
            "remote_code_execution"
        ],
        "categories": [
            "reverse_shell"
        ],
        "targets": [
            "windows"
        ]
    },
    {
        "name": "Host",
        "url": "https://www.isc.org/",
        "source": "https://www.isc.org/bind/",
        "description": "The host command is a simple DNS lookup utility used to find IP addresses, domain names, mail servers, and other DNS-related information.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Hostapd-Mana",
        "url": "https://w1f1.net/",
        "source": "https://github.com/sensepost/hostapd-mana",
        "description": "Hostapd-Mana is a feature-rich rogue Wi-Fi access point tool. It can be used for various purposes, including tracking and deanonymizing devices (Snoopy), gathering corporate credentials from devices attempting EAP authentication (WPE), or attracting multiple devices to connect for MITM attacks. It enhances rogue access point (AP) attacks by bypassing common security mechanisms and capturing credentials from clients. Key features include Rogue Access Point (Evil Twin AP), EAP credential harvesting, Karma attack, SSID mimicry, SSL strip support, captive portal attacks, and integration with tools such as Bettercap, Aircrack-ng, and Responder.",
        "techniques": [
            "exploitation",
            "password_attack"
        ],
        "categories": [
            "rogue_access_point"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network"
        ]
    },
    {
        "name": "Hping3",
        "url": "https://www.hping.org/",
        "source": "https://github.com/antirez/hping",
        "description": "Hping3 is a command-line network security tool used for packet crafting, scanning, and network testing. It is similar to ping but offers more advanced features, allowing users to send custom TCP, UDP, ICMP, and raw IP packets.",
        "techniques": [
            "enumeration"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "HTTP Observatory",
        "url": "https://developer.mozilla.org/en-US/observatory",
        "source": "https://github.com/mdn/mdn-http-observatory",
        "description": "The Mozilla HTTP Observatory is a passive web security scanner that checks a website’s HTTP response headers and TLS configuration for best practices and known misconfigurations.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "header_analysis",
            "misconfigs",
            "web_app"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "httprint",
        "url": "https://net-square.com/httprint.html",
        "source": "https://net-square.com/httprint.html",
        "description": "httprint is a web server fingerprinting tool that helps identify web server software and versions based on their HTTP responses.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "HTTProbe",
        "url": "https://github.com/tomnomnom/httprobe",
        "source": "https://github.com/tomnomnom/httprobe",
        "description": "Take a list of domains and probe for working http and https servers.",
        "techniques": [
            "enumeration",
            "networking"
        ],
        "categories": [],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "HTTPX",
        "url": "https://projectdiscovery.io/",
        "source": "https://github.com/projectdiscovery/httpx",
        "description": "HTTPX is a fast and multi-purpose HTTP toolkit that allows running multiple probes using the retryablehttp library. It is designed to maintain result reliability with an increased number of threads.",
        "techniques": [
            "enumeration",
            "networking"
        ],
        "categories": [
            "fingerprinting",
            "header_analysis",
            "OSINT"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "HTTrack Website Copier",
        "url": "https://www.httrack.com/",
        "source": "https://github.com/xroche/httrack",
        "description": "HTTrack is an offline browser utility that allows you to download an entire website from the Internet to a local directory. It recursively builds all directories and retrieves HTML, images, and other files from the server to your computer. HTTrack preserves the original site's relative link structure.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "website_mirroring"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Hurricane Electric BGP Toolkit",
        "url": "https://bgp.he.net/",
        "source": "https://bgp.he.net/",
        "description": "Hurricane Electric BGP Toolkit.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "host_discovery",
            "network_scanner",
            "OSINT",
            "subdomain_enum"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Hybrid Analysis",
        "url": "https://hybrid-analysis.com/",
        "source": "https://hybrid-analysis.com/",
        "description": "This is a free malware analysis service for the community that detects and analyzes unknown threats using a unique Hybrid Analysis technology. It is an online service that provides deep insights into potentially malicious files and URLs.",
        "techniques": [
            "forensics",
            "malware_analysis"
        ],
        "categories": [
            "OSINT",
            "web_app"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "Hydra",
        "url": "https://github.com/vanhauser-thc/thc-hydra",
        "source": "https://github.com/vanhauser-thc/thc-hydra",
        "description": "THC-Hydra is a parallelized login cracker capable of performing rapid brute-force and dictionary attacks against various services. It is commonly used in penetration testing environments like Kali Linux and Parrot OS. The tool supports numerous protocols.",
        "techniques": [
            "exploitation",
            "password_attack"
        ],
        "categories": [],
        "targets": [
            "database",
            "network",
            "web"
        ]
    },
    {
        "name": "Impacket",
        "url": "https://www.coresecurity.com/",
        "source": "https://github.com/fortra/impacket",
        "description": "Impacket is a collection of Python classes for working with network protocols.",
        "techniques": [
            "exploitation",
            "password_attack",
            "post_exploitation"
        ],
        "categories": [
            "active_directory",
            "credential_dumping"
        ],
        "targets": [
            "windows"
        ]
    },
    {
        "name": "inSSIDer",
        "url": "https://www.metageek.com/inssider/",
        "source": "https://www.metageek.com/inssider/",
        "description": "inSSIDer is a Wi-Fi network analysis tool developed by MetaGeek. It helps users analyze and optimize their Wi-Fi networks by providing insights into signal strength, interference, and channel usage.",
        "techniques": [
            "footprinting"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "Intelligence X",
        "url": "https://intelx.io/",
        "source": "https://intelx.io/",
        "description": "Intelligence X stands out from other search engines by enabling searches using specific selectors like email addresses, domains, IPs, Bitcoin addresses, and more. It explores unique sources such as the darknet, document sharing platforms, public data leaks, and WHOIS data, while also maintaining a historical archive of results, similar to the Wayback Machine.",
        "techniques": [
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "dark_web",
            "OSINT",
            "search_engine"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Internet Archive",
        "url": "https://archive.org/",
        "source": "https://archive.org/",
        "description": "Internet Archive is a non-profit library of millions of free texts, movies, software, music, websites, and more.",
        "techniques": [
            "forensics",
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "OSINT",
            "search_engine",
            "web_archive"
        ],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "InternalAllTheThings",
        "url": "https://swisskyrepo.github.io/InternalAllTheThings/",
        "source": "https://github.com/swisskyrepo/InternalAllTheThings",
        "description": "Active Directory and Internal Pentest Cheatsheets",
        "techniques": [
            "exploitation",
            "malware_analysis"
        ],
        "categories": [
            "active_directory",
            "payload",
            "web_app",
            "wordlists"
        ],
        "targets": [
            "cloud",
            "database",
            "network",
            "web"
        ]
    },
    {
        "name": "Investigator",
        "url": "https://abhijithb200.github.io/investigator/",
        "source": "https://github.com/abhijithb200/investigator",
        "description": "A web based handy-recon tool that uses different Google Dorking techniques and some open sources service to find juicy information about target websites.",
        "techniques": [
            "enumeration",
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "network_scanner",
            "OSINT",
            "web_app"
        ],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "IoTSeeker",
        "url": "https://information.rapid7.com/iotseeker.html",
        "source": "https://github.com/rapid7/IoTSeeker",
        "description": "IoTSeeker allows you to scan your network for known device types that could be used as unwilling participants in a distributed denial-of-service attack.  With this tool you can find out if you have connected “Things” which are using the default factory password leaving them potentially vulnerable to a hostile takeover. Use the local scan output to determine which devices need to be secured or removed from the network.",
        "techniques": [],
        "categories": [
            "network_scanner",
            "OSINT"
        ],
        "targets": [
            "IoT"
        ]
    },
    {
        "name": "John the Ripper",
        "url": "https://www.openwall.com/john/",
        "source": "https://github.com/openwall/john",
        "description": "John the Ripper Jumbo is an advanced offline password cracker that supports hundreds of hash and cipher types. Its primary purpose is to identify weak Unix passwords. It is an open-source tool for password security auditing and recovery.",
        "techniques": [
            "password_attack"
        ],
        "categories": [
            "hash"
        ],
        "targets": []
    },
    {
        "name": "JsFinder",
        "url": "https://github.com/kacakb/jsfinder",
        "source": "https://github.com/kacakb/jsfinder",
        "description": "JsFinder is a command-line tool written in Go that scans web pages to find JavaScript files linked in the HTML source code. It searches for any attribute that can contain a JavaScript file (e.g., src, href, data-main, etc.) and extracts the URLs of the files to a text file.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "javascript",
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "JShunter",
        "url": "https://github.com/cc1a2b/jshunter",
        "source": "https://github.com/cc1a2b/jshunter",
        "description": "JShunter is a command-line tool designed for analyzing JavaScript files and extracting endpoints. This tool specializes in identifying sensitive data, such as API endpoints and potential security vulnerabilities.",
        "techniques": [
            "content_discovery",
            "reconnaissance"
        ],
        "categories": [
            "javascript",
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "JSONLint",
        "url": "https://jsonlint.com/",
        "source": "https://github.com/circlecell/jsonlint",
        "description": "JSONLint is your go-to online solution for JSON validation, formatting, and conversion. Whether you're debugging APIs, transforming data formats, or generating code from JSON schemas, JSONLint has you covered.",
        "techniques": [],
        "categories": [
            "JSON",
            "JWT",
            "web_app"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "JWT Debugger",
        "url": "https://jwt.io/",
        "source": "https://jwt.io/",
        "description": "JWT.io is a JWT (JSON Web Token) debugging and educational tool by Auth0 that allows users to decode tokens, manually verify signatures, inspect token structure, learn about signing algorithms like HS256 and RS256, and explore JWT libraries for various programming languages.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "authentication",
            "JWT",
            "web_app"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "JWT Security Checker",
        "url": "https://xjwt.io/",
        "source": "https://github.com/exploit-forge/xjwt",
        "description": "JWT Security Checker is a professional-grade security testing platform designed for penetration testers, security researchers, and developers to analyze and test JSON Web Token implementations.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "authentication",
            "JWT",
            "web_app"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "JWTAuditor",
        "url": "https://jwtauditor.com/",
        "source": "https://github.com/dr34mhacks/jwtauditor",
        "description": "JWTAuditor is a specialized tool for analyzing and detecting security issues in JSON Web Tokens (JWTs). It can be used to detect vulnerable JWT implementations, misconfigurations, and exploitable signing techniques.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "authentication",
            "JWT",
            "web_app"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "JWTLens",
        "url": "https://jwtlens.netlify.app/",
        "source": "https://github.com/chawdamrunal/JWTLens-Local",
        "description": "Advanced JWT Security Analysis & Vulnerability Detection",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "authentication",
            "JWT",
            "web_app"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Katana",
        "url": "https://projectdiscovery.io/",
        "source": "https://github.com/projectdiscovery/katana",
        "description": "Katana is a powerful web crawler and content discovery tool that parses JavaScript files, sitemaps, and HTML to identify URLs, endpoints, and parameters for security testing.",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "crawler",
            "fingerprinting",
            "javascript",
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Keyhacks",
        "url": "https://github.com/streaak/keyhacks",
        "source": "https://github.com/streaak/keyhacks",
        "description": "KeyHacks shows methods to validate different API keys found on a Bug Bounty Program or a pentest.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "credential"
        ],
        "targets": [
            "API"
        ]
    },
    {
        "name": "KisMAC",
        "url": "https://kismac-ng.org/",
        "source": "https://github.com/IGRSoft/KisMac2",
        "description": "KisMAC is a free, open-source WiFi scanner for Mac that helps you gather key information about nearby networks. It can detect SSIDs, display connected clients, map WiFi coverage, and more.",
        "techniques": [],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "mac",
            "network",
            "wireless"
        ]
    },
    {
        "name": "Kismet",
        "url": "https://www.kismetwireless.net/",
        "source": "https://github.com/kismetwireless/kismet",
        "description": "Kismet is an open source sniffer, WIDS, wardriver, and packet capture tool for Wi-Fi, Bluetooth, BTLE, wireless thermometers, airplanes, power meters, Zigbee, and more.",
        "techniques": [
            "sniffing"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network"
        ]
    },
    {
        "name": "Knock",
        "url": "https://github.com/guelfoweb/knock",
        "source": "https://github.com/guelfoweb/knock",
        "description": "Knockpy is a portable and modular python3 tool designed to quickly enumerate subdomains on a target domain through passive reconnaissance and dictionary scan.",
        "techniques": [
            "enumeration"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Kube-bench",
        "url": "https://github.com/aquasecurity/kube-bench",
        "source": "https://github.com/aquasecurity/kube-bench",
        "description": "Kube-hunter hunts for security weaknesses in Kubernetes clusters. The tool was developed to increase awareness and visibility for security issues in Kubernetes environments.",
        "techniques": [],
        "categories": [
            "misconfigs"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Kube-hunter",
        "url": "https://github.com/aquasecurity/kube-hunter",
        "source": "https://github.com/aquasecurity/kube-hunter",
        "description": "Kube-hunter hunts for security weaknesses in Kubernetes clusters. The tool was developed to increase awareness and visibility for security issues in Kubernetes environments.",
        "techniques": [],
        "categories": [
            "misconfigs"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Kubescape",
        "url": "https://kubescape.io/",
        "source": "https://github.com/kubescape/kubescape",
        "description": "Kubescape is an open-source Kubernetes security platform that provides comprehensive security coverage, from left to right across the entire development and deployment lifecycle. It offers hardening, posture management, and runtime security capabilities to ensure robust protection for Kubernetes environments. It saves Kubernetes users and admins precious time, effort, and resources.",
        "techniques": [],
        "categories": [
            "misconfigs"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "L0phtCrack",
        "url": "https://l0phtcrack.gitlab.io/",
        "source": "https://gitlab.com/l0phtcrack",
        "description": "L0phtCrack is a password auditing and recovery tool used to assess the strength of passwords by cracking Windows account passwords using various attack techniques. It features Password Hash Extraction, Multiple Cracking Techniques, and Automated Auditing, making it a powerful tool for security testing and compliance checks.",
        "techniques": [
            "password_attack"
        ],
        "categories": [
            "credential_dumping",
            "hash"
        ],
        "targets": []
    },
    {
        "name": "LDAPHunter",
        "url": "https://github.com/GhnimiWael/LDAPHunter",
        "source": "https://github.com/GhnimiWael/LDAPHunter",
        "description": "This Python tool automates LDAP enumeration for penetration testers, extracting users, groups, organizational units (OUs), password policies, and other critical Active Directory/LDAP information.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "active_directory",
            "network_scanner"
        ],
        "targets": [
            "network",
            "windows"
        ]
    },
    {
        "name": "LinkFinder",
        "url": "https://github.com/GerbenJavado/LinkFinder",
        "source": "https://github.com/GerbenJavado/LinkFinder",
        "description": "LinkFinder is a python script written to discover endpoints and their parameters in JavaScript files.",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "extension",
            "fingerprinting",
            "javascript",
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Linkook",
        "url": "https://github.com/JackJuly/linkook",
        "source": "https://github.com/JackJuly/linkook",
        "description": "Linkook is an OSINT tool for discovering linked/connected social accounts and associated emails across multiple platforms using a single username. It also supports exporting the gathered relationships in a Neo4j-friendly format for visual analysis.",
        "techniques": [
            "reconnaissance",
            "social_engineering"
        ],
        "categories": [],
        "targets": [
            "people"
        ]
    },
    {
        "name": "Linux Router",
        "url": "https://github.com/garywill/linux-router",
        "source": "https://github.com/garywill/linux-router",
        "description": "Set up Linux as a router with a single command, supporting internet sharing, a transparent proxy (redsocks), WiFi hotspot, and IPv6. It can also be used for routing VMs and containers. Key features include creating a NATed sub-network, providing internet access, running a DHCP server (with RA), acting as a DNS server, supporting IPv6 behind a NATed LAN (similar to IPv4), creating a WiFi hotspot or access point, enabling a transparent proxy (redsocks), and hijacking port 53 packets for transparent DNS proxying.",
        "techniques": [
            "hijacking"
        ],
        "categories": [
            "rogue_access_point"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network"
        ]
    },
    {
        "name": "Linux Wifi Hotspot",
        "url": "https://github.com/lakinduakash/linux-wifi-hotspot",
        "source": "https://github.com/lakinduakash/linux-wifi-hotspot",
        "description": "Feature-rich wifi hotspot creator for Linux which provides both GUI and command-line interface. It is also able to create a hotspot using the same wifi card which is connected to an AP already ( Similar to Windows 10). The tool supports 2.4GHz and 5GHz frequencies, works with WPA3 encryption, and includes a bridged mode for sharing an existing connection. It also offers MAC filtering support and an easy setup with a single script.",
        "techniques": [],
        "categories": [
            "rogue_access_point"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network"
        ]
    },
    {
        "name": "Linux Exploit Suggester",
        "url": "https://github.com/The-Z-Labs/linux-exploit-suggester",
        "source": "https://github.com/The-Z-Labs/linux-exploit-suggester",
        "description": "The LES tool is designed to assist in detecting security deficiencies in a given Linux kernel or Linux-based machine by assessing kernel exposure to publicly known exploits and verifying the state of kernel hardening security measures.",
        "techniques": [
            "exploitation",
            "privilege_escalation",
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "linux"
        ]
    },
    {
        "name": "LOIC",
        "url": "https://github.com/NewEraCracker/LOIC/",
        "source": "https://github.com/NewEraCracker/LOIC/",
        "description": "Low Orbit Ion Cannon (LOIC) is an open source network stress tool, written in C#. LOIC is based on Praetox's LOIC project.",
        "techniques": [
            "denial_of_service"
        ],
        "categories": [],
        "targets": [
            "android"
        ]
    },
    {
        "name": "MagicRecon",
        "url": "https://github.com/robotshell/magicRecon",
        "source": "https://github.com/robotshell/magicRecon",
        "description": "MagicRecon is a powerful shell script to maximize the recon and data collection process of an objective and finding common vulnerabilities, all this saving the results obtained in an organized way in directories and with various formats.",
        "techniques": [
            "enumeration",
            "reconnaissance",
            "SQL_injection",
            "XSS"
        ],
        "categories": [
            "fingerprinting",
            "network_scanner",
            "OSINT",
            "subdomain_enum"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Magisk",
        "url": "https://github.com/topjohnwu/Magisk",
        "source": "https://github.com/topjohnwu/Magisk",
        "description": "Magisk is a suite of open source software for customizing Android, supporting devices higher than Android 6.0.",
        "techniques": [
            "exploitation",
            "privilege_escalation"
        ],
        "categories": [
            "root"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "Maltego",
        "url": "https://www.maltego.com/",
        "source": "https://www.maltego.com/",
        "description": "Maltego is a graph-based intelligence and forensics tool used for OSINT gathering, link analysis, and data visualization. It discovers relationships between entities such as domains, IP addresses, emails, social media accounts, infrastructure, and threat actors.",
        "techniques": [
            "forensics",
            "footprinting",
            "social_engineering"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "Masscan",
        "url": "https://github.com/robertdavidgraham/masscan",
        "source": "https://github.com/robertdavidgraham/masscan",
        "description": "Masscan is an Internet-scale TCP port scanner that can scan the entire Internet in under five minutes by asynchronously spewing SYN packets at a rate of 10 million packets per second from a single machine.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "host_discovery",
            "network_scanner",
            "port_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "MDK4",
        "url": "https://aircrack-ng.org/",
        "source": "https://github.com/aircrack-ng/mdk4",
        "description": "MDK4 is a network penetration testing tool used for Wi-Fi security assessments. MDK4 is a new version of MDK3. It is specifically designed to test wireless networks by exploiting vulnerabilities in various Wi-Fi protocols, including WEP, WPA, WPA2, and WPA3. MDK4 can be used for multiple Wi-Fi attack scenarios, such as deauthentication attacks, authentication flooding, beacon flooding, probe request/response attacks, EAPOL attacks, TKIP MIC attacks, and Wi-Fi channel hopping attacks.",
        "techniques": [
            "exploitation",
            "password_attack"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network",
            "wireless"
        ]
    },
    {
        "name": "Metagoofil",
        "url": "https://github.com/opsdisk/metagoofil",
        "source": "https://github.com/opsdisk/metagoofil",
        "description": "Metagoofil is an open-source tool that gathers metadata from publicly available documents on the internet. It extracts information such as usernames, software versions, and emails from PDFs, DOCs, XLSs, and PPTs. It searches Google for specific file types and can optionally download them.",
        "techniques": [
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Metasploit",
        "url": "https://www.metasploit.com/",
        "source": "https://github.com/rapid7/metasploit-framework",
        "description": "An open-source project that provides the infrastructure, content, and tools for performing penetration tests and extensive security audits. It is a framework used for exploiting, testing, and securing systems, offering a collection of exploits, payloads, scanners, and post-exploitation tools.",
        "techniques": [
            "enumeration",
            "exploitation",
            "post_exploitation",
            "remote_code_execution"
        ],
        "categories": [
            "evasion",
            "network_scanner",
            "reverse_shell"
        ],
        "targets": [
            "android",
            "database",
            "IoT",
            "linux",
            "mac",
            "network",
            "windows"
        ]
    },
    {
        "name": "MicroBurst",
        "url": "https://github.com/NetSPI/MicroBurst",
        "source": "https://github.com/NetSPI/MicroBurst",
        "description": "MicroBurst includes functions and scripts that support Azure Services discovery, weak configuration auditing, and post exploitation actions such as credential dumping. It is intended to be used during penetration tests where Azure is in use.",
        "techniques": [
            "exploitation",
            "post_exploitation"
        ],
        "categories": [
            "credential_dumping"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Mimikatz",
        "url": "https://parrotsec.org/",
        "source": "https://gitlab.com/parrotsec",
        "description": "Extract plaintext passwords, hashes, PINs, and Kerberos tickets from memory, as well as perform pass-the-hash, pass-the-ticket, and create Golden Tickets.",
        "techniques": [
            "password_attack",
            "post_exploitation",
            "privilege_escalation"
        ],
        "categories": [
            "active_directory",
            "credential_dumping"
        ],
        "targets": [
            "windows"
        ]
    },
    {
        "name": "MobSF",
        "url": "https://opensecurity.in/",
        "source": "https://github.com/MobSF/Mobile-Security-Framework-MobSF",
        "description": "Mobile Security Framework (MobSF) is an automated, all-in-one platform for mobile application (Android, iOS, Windows) security assessment, penetration testing, malware analysis, and privacy analysis. It supports both static and dynamic analysis, processing popular app binaries like APK, IPA, and APPX, as well as source code. The Dynamic Analyzer enables interactive instrumented testing, runtime data monitoring, and network traffic analysis for Android and iOS applications. MobSF also integrates seamlessly with DevSecOps and CI/CD pipelines via REST APIs and CLI tools, enhancing security workflows efficiently.",
        "techniques": [
            "malware_analysis"
        ],
        "categories": [
            "APK_analyzer"
        ],
        "targets": [
            "android",
            "iOS",
            "web",
            "windows"
        ]
    },
    {
        "name": "Mole",
        "url": "https://themole.nasel.com.ar/",
        "source": "https://sourceforge.net/projects/themole/",
        "description": "Mole is an automatic SQL Injection exploitation tool. Only by providing a vulnerable URL and a valid string on the site it can detect the injection and exploit it, either by using the union technique or a boolean query based technique.",
        "techniques": [
            "SQL_injection",
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "database",
            "network",
            "web"
        ]
    },
    {
        "name": "Mrphish",
        "url": "https://www.noob-hackers.com/",
        "source": "https://github.com/noob-hackers/mrphish",
        "description": "MrPhish is a Bash-based script officially designed for phishing social media accounts with port forwarding and OTP bypass control. This tool works on both rooted and non-rooted Android devices.",
        "techniques": [
            "phishing",
            "social_engineering"
        ],
        "categories": [],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "MW Youtube Metadata",
        "url": "https://mattw.io/youtube-metadata/",
        "source": "https://github.com/mattwright324/youtube-metadata",
        "description": "MW Metadata normal grabs singular details about a YouTube video and its uploader, playlist and its creator, or channel.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "OSINT",
            "web_app"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "MXToolBox",
        "url": "https://mxtoolbox.com/",
        "source": "https://mxtoolbox.com/",
        "description": "MXToolbox is a free online toolset for email, DNS, and network diagnostics. It is widely used by IT professionals, system administrators, and security experts to monitor and troubleshoot email servers, DNS records, and blacklists.",
        "techniques": [
            "enumeration",
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "NAPALM FTP Indexer",
        "url": "https://www.searchftps.net/",
        "source": "https://www.searchftps.net/",
        "description": "NAPALM FTP Indexer is an advanced FTP search engine that allows users to search and download files from public FTP servers. It maintains a comprehensive database of files from numerous FTP servers, updated regularly by an intelligent FTP crawler.",
        "techniques": [
            "footprinting"
        ],
        "categories": [
            "OSINT",
            "search_engine"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "NBTscan",
        "url": "https://github.com/resurrecting-open-source-projects/nbtscan",
        "source": "https://github.com/resurrecting-open-source-projects/nbtscan",
        "description": "NBTscan is a program for scanning IP networks for NetBIOS name information. For each responding host it lists IP address, NetBIOS computer name, logged-in user name and MAC address (such as Ethernet).",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Ncrack",
        "url": "https://nmap.org/ncrack/",
        "source": "https://github.com/nmap/ncrack",
        "description": "Ncrack is a high-speed network authentication cracking tool. It was built to help companies secure their networks by proactively testing all their hosts and networking devices for poor passwords. Security professionals also rely on Ncrack when auditing their clients.",
        "techniques": [
            "password_attack"
        ],
        "categories": [
            "hash"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Nessus",
        "url": "https://www.tenable.com/products/nessus",
        "source": "https://www.tenable.com/products/nessus",
        "description": "Nessus is a widely used vulnerability scanner developed by Tenable. It helps identify potential vulnerabilities, misconfigurations, and security issues in your systems, network devices, and web applications. It scans for a variety of known security flaws, including those related to software versions, missing patches, and weak configurations, to help organizations improve their security posture.",
        "techniques": [
            "vulnerability_assessment"
        ],
        "categories": [
            "misconfigs",
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Netcat",
        "url": "https://nc110.sourceforge.io/",
        "source": "https://sourceforge.net/projects/nc110/",
        "description": "The Swiss Army Knife of Networking - Netcat (nc) is a simple Unix utility which reads and writes data across network connections, using TCP or UDP protocol. it can create almost any kind of connection you would need and has several interesting built-in capabilities.",
        "techniques": [
            "enumeration",
            "footprinting",
            "sniffing"
        ],
        "categories": [
            "network_scanner",
            "reverse_shell"
        ],
        "targets": [
            "IoT",
            "linux",
            "mac",
            "network",
            "windows"
        ]
    },
    {
        "name": "Netcraft Research Tools",
        "url": "https://www.netcraft.com/tools/",
        "source": "https://www.netcraft.com/tools/",
        "description": "Tools to discover the infrastructure and technologies a site is using, identify the most popular websites, and enhance internet safety.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "web_app"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Nikto",
        "url": "https://cirt.net/Nikto2",
        "source": "https://github.com/sullo/nikto",
        "description": "Nikto is an Open Source web server scanner which performs comprehensive tests against web servers for multiple items, including over 7,000 potentially dangerous files/programs, checks for outdated versions of over 1250 servers, and version specific problems on over 270 servers. It also checks for server configuration items such as the presence of multiple index files, HTTP server options, and will attempt to identify installed web servers and software.",
        "techniques": [
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "njRAT",
        "url": "https://github.com/BlackAll9/NjRat.0.7D",
        "source": "https://github.com/BlackAll9/NjRat.0.7D",
        "description": "NjRAT-0.7D is a powerful remote administration tool (RAT) for Windows systems, enabling remote access and control of infected machines. It is capable of keylogging, webcam access, credential theft, file manipulation, desktop viewing, and botnet control.",
        "techniques": [
            "exploitation",
            "hijacking",
            "post_exploitation",
            "remote_code_execution"
        ],
        "categories": [
            "RAT"
        ],
        "targets": [
            "windows"
        ]
    },
    {
        "name": "Nmap",
        "url": "https://nmap.org/",
        "source": "https://github.com/nmap/",
        "description": "Network Mapper scans networks to identify devices, open ports, services, and detect OS and service versions. It also performs vulnerability scanning and automates network scanning tasks.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "host_discovery",
            "network_scanner",
            "port_scanner",
            "WAF_detection"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "NoRLCheck",
        "url": "https://github.com/shifa123/NoRLCheck",
        "source": "https://github.com/shifa123/NoRLCheck",
        "description": "This is the python script to check for the website if vulnerable to No RL.",
        "techniques": [],
        "categories": [
            "rate_limit"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "NoSQLMap",
        "url": "https://github.com/codingo/NoSQLMap",
        "source": "https://github.com/codingo/NoSQLMap",
        "description": "NoSQLMap is an open source Python tool designed to audit for as well as automate injection attacks and exploit default configuration weaknesses in NoSQL databases and web applications using NoSQL in order to disclose or clone data from the database.",
        "techniques": [
            "exploitation",
            "SQL_injection",
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "database",
            "network",
            "web"
        ]
    },
    {
        "name": "Nslookup",
        "url": "https://www.isc.org/",
        "source": "https://www.isc.org/bind/",
        "description": "The nslookup (Name Server Lookup) command is a DNS query tool used to find IP addresses, domain names, mail servers, and other DNS records.",
        "techniques": [
            "enumeration",
            "footprinting"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Nuclei",
        "url": "https://projectdiscovery.io/",
        "source": "https://github.com/projectdiscovery/nuclei",
        "description": "Nuclei is a fast, customizable vulnerability scanner powered by the global security community and built on a simple YAML-based DSL, enabling collaboration to tackle trending vulnerabilities on the internet. It helps you find vulnerabilities in your applications, APIs, networks, DNS, and cloud configurations.",
        "techniques": [
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Objection",
        "url": "https://github.com/sensepost/objection",
        "source": "https://github.com/sensepost/objection",
        "description": "Objection is a runtime mobile exploration toolkit powered by Frida, designed to help assess the security posture of mobile applications without requiring a jailbreak. It supports both iOS and Android, allowing you to inspect and interact with container file systems, bypass SSL pinning, dump keychains, perform memory-related tasks like dumping and patching, explore and manipulate objects on the heap, and much more.",
        "techniques": [
            "forensics",
            "enumeration",
            "malware_analysis"
        ],
        "categories": [
            "credential_dumping"
        ],
        "targets": [
            "android",
            "iOS"
        ]
    },
    {
        "name": "OpenStego",
        "url": "https://www.openstego.com/",
        "source": "https://github.com/syvaidya/openstego",
        "description": "OpenStego is a steganography application that provides two functionalities: a) Data Hiding: It can hide any data within an image file. b) Watermarking: Watermarking image files with an invisible signature. It can be used to detect unauthorized file copying.",
        "techniques": [
            "forensics",
            "steganography"
        ],
        "categories": [
            "exfiltration",
            "evasion"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "OpenVAS",
        "url": "https://openvas.org/",
        "source": "https://github.com/greenbone/openvas-scanner",
        "description": "OpenVAS is a full-featured vulnerability scanner. Its capabilities include unauthenticated and authenticated testing, various high-level and low-level internet and industrial protocols, performance tuning for large-scale scans and a powerful internal programming language to implement any type of vulnerability test.",
        "techniques": [
            "vulnerability_assessment"
        ],
        "categories": [
            "network_scanner",
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Ophcrack",
        "url": "https://ophcrack.sourceforge.io/",
        "source": "https://gitlab.com/objectifsecurite/ophcrack",
        "description": "Ophcrack is a free and open-source tool used for cracking Windows login passwords using rainbow tables. It's a popular tool among ethical hackers, penetration testers, and forensic investigators to recover lost or forgotten passwords, especially on older versions of Windows.",
        "techniques": [
            "password_attack"
        ],
        "categories": [
            "credential_dumping",
            "hash"
        ],
        "targets": [
            "windows"
        ]
    },
    {
        "name": "OSINT.SH",
        "url": "https://osint.sh/",
        "source": "https://github.com/secgron/osint.sh",
        "description": "All in one Information Gathering Tools - Public Buckets Search, Subdomain Finder, DNS History, Reverse IP Lookup, Technology Lookup, Certificate Search, DNS Lookup, Reverse Google Analytics/AdSense, Whois History, Reverse Whois, OCR Text Extractor, and MD5 Hash Guessing.",
        "techniques": [
            "enumeration",
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT",
            "web_app"
        ],
        "targets": [
            "cloud",
            "network",
            "web"
        ]
    },
    {
        "name": "OSINT Framework",
        "url": "https://osintframework.com/",
        "source": "https://github.com/lockfale/osint-framework",
        "description": "OSINT framework focused on gathering information from free tools or resources. The intention is to help people find free OSINT resources.",
        "techniques": [
            "enumeration",
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "OSINT",
            "web_app"
        ],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "Pacu",
        "url": "https://rhinosecuritylabs.com/aws/pacu-open-source-aws-exploitation-framework/",
        "source": "https://github.com/RhinoSecurityLabs/pacu",
        "description": "Pacu is an open-source AWS exploitation framework, designed for offensive security testing against cloud environments. Created and maintained by Rhino Security Labs, Pacu allows penetration testers to exploit configuration flaws within an AWS account, using modules to easily expand its functionality. Current modules enable a range of attacks, including user privilege escalation, backdooring of IAM users, attacking vulnerable Lambda functions, and much more.",
        "techniques": [
            "exploitation",
            "privilege_escalation"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Payloads All The PDFs",
        "url": "https://github.com/luigigubello/PayloadsAllThePDFs",
        "source": "https://github.com/luigigubello/PayloadsAllThePDFs",
        "description": "A list of crafted malicious PDF files to test the security of PDF readers and tools.",
        "techniques": [
            "exploitation",
            "malware_analysis"
        ],
        "categories": [
            "payload"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "PayloadsAllTheThings",
        "url": "https://swisskyrepo.github.io/PayloadsAllTheThings/",
        "source": "https://github.com/swisskyrepo/PayloadsAllTheThings",
        "description": "A list of useful payloads and bypass for Web Application Security and Pentest/CTF",
        "techniques": [
            "exploitation",
            "malware_analysis"
        ],
        "categories": [
            "payload",
            "web_app",
            "wordlists"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Payload Box",
        "url": "https://github.com/payloadbox",
        "source": "https://github.com/payloadbox",
        "description": "Attack payloads only.",
        "techniques": [
            "exploitation",
            "malware_analysis"
        ],
        "categories": [
            "payload"
        ],
        "targets": []
    },
    {
        "name": "ParamSpider",
        "url": "https://github.com/devanshbatham/ParamSpider",
        "source": "https://github.com/devanshbatham/ParamSpider",
        "description": "paramspider allows you to fetch URLs related to any domain or a list of domains from Wayback achives. It filters out \"boring\" URLs, allowing you to focus on the ones that matter the most.",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fuzzing",
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "PDF Injection",
        "url": "https://github.com/kaanatmacaa/pdf-injection",
        "source": "https://github.com/kaanatmacaa/pdf-injection",
        "description": "Tool to create XSS PDF files.",
        "techniques": [
            "XSS"
        ],
        "categories": [
            "payload",
            "polyglot"
        ],
        "targets": [
            "files",
            "web"
        ]
    },
    {
        "name": "PDF Payload Injection Tool",
        "url": "https://github.com/Sic4rio/pdf-payload-injection-tool",
        "source": "https://github.com/Sic4rio/pdf-payload-injection-tool",
        "description": "A tool for injecting custom JavaScript payloads into PDF files for penetration testing and XSS proof-of-concept generation.",
        "techniques": [
            "exploitation",
            "XSS"
        ],
        "categories": [
            "payload"
        ],
        "targets": [
            "files",
            "web"
        ]
    },
    {
        "name": "Pdfinfo",
        "url": "https://www.xpdfreader.com/",
        "source": "https://www.xpdfreader.com/download.html",
        "description": "Pdfinfo is a command-line tool used to extract metadata and document properties from PDF files. It is part of the Poppler-utils package.",
        "techniques": [
            "forensics"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "PEASS-NG",
        "url": "https://book.hacktricks.xyz/",
        "source": "https://github.com/peass-ng/PEASS-ng",
        "description": "Privilege Escalation Awesome Scripts - Next Generation is a post-exploitation toolkit for Windows and Linux, automating privilege escalation discovery by identifying misconfigurations, vulnerable services, and weak permissions.",
        "techniques": [
            "exploitation",
            "post_exploitation",
            "privilege_escalation"
        ],
        "categories": [],
        "targets": [
            "linux",
            "windows"
        ]
    },
    {
        "name": "Pentest Tools",
        "url": "https://pentest-tools.com/",
        "source": "https://pentest-tools.com/",
        "description": "Pentest-Tools.com develops offensive cybersecurity tools and proprietary vulnerability scanning software for penetration testers and other infosec professionals.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "PhoneSploit Pro",
        "url": "https://github.com/AzeemIdrisi/PhoneSploit-Pro",
        "source": "https://github.com/AzeemIdrisi/PhoneSploit-Pro",
        "description": "An all-in-one hacking tool designed to remotely exploit Android devices using ADB and the Metasploit Framework to establish a Meterpreter session. This tool can automatically create, install, and execute payloads on a target device using Metasploit Framework and ADB, enabling complete control of the Android device in a single click. It streamlines the process of payload creation, installation, and execution, making penetration testing and vulnerability assessments more efficient.",
        "techniques": [
            "exploitation",
            "hijacking",
            "remote_code_execution"
        ],
        "categories": [
            "ADB"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "PHP Reverse Shell",
        "url": "https://github.com/pentestmonkey/php-reverse-shell",
        "source": "https://github.com/pentestmonkey/php-reverse-shell",
        "description": "A Reverse Shell implementation in PHP",
        "techniques": [
            "exploitation",
            "remote_code_execution"
        ],
        "categories": [
            "payload",
            "reverse_shell"
        ],
        "targets": []
    },
    {
        "name": "Photon",
        "url": "https://github.com/s0md3v/Photon",
        "source": "https://github.com/s0md3v/Photon",
        "description": "Photon is an OSINT tool used for web scraping and data extraction. It can retrieve archived URLs of the target website from Archive.org.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "crawler",
            "OSINT",
            "web_archive",
            "website_mirroring"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "PhotoRec",
        "url": "https://www.cgsecurity.org/",
        "source": "https://www.cgsecurity.org/wiki/PhotoRec",
        "description": "PhotoRec is an open-source file recovery tool designed to retrieve lost or deleted files from hard drives, memory cards, USB drives, and other storage devices. It is commonly used in digital forensics and data recovery to extract lost evidence or accidentally deleted files. It will work even if the media's file system is severely damaged or reformatted.",
        "techniques": [
            "forensics"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "hardware"
        ]
    },
    {
        "name": "Prowler",
        "url": "https://prowler.com/",
        "source": "https://github.com/prowler-cloud/prowler",
        "description": "Prowler is an Open Cloud Security tool for AWS, Azure, GCP and Kubernetes. It helps for continuos monitoring, security assessments and audits, incident response, compliance, hardening and forensics readiness. Includes CIS, NIST 800, NIST CSF, CISA, FedRAMP, PCI-DSS, GDPR, HIPAA, FFIEC, SOC2, GXP, Well-Architected Security, ENS and more.",
        "techniques": [],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Pwdump",
        "url": "https://www.openwall.com/passwords/windows-pwdump",
        "source": "https://github.com/Seabreg/pwdump",
        "description": "Pwdump is a family of Windows password hash dumping tools used to extract NTLM and LANMAN password hashes from the Security Account Manager (SAM) database. These hashes can then be analyzed or cracked using password-cracking tools like John the Ripper or Hashcat.",
        "techniques": [
            "password_attack"
        ],
        "categories": [
            "active_directory",
            "credential_dumping"
        ],
        "targets": [
            "network",
            "windows"
        ]
    },
    {
        "name": "Raccoon",
        "url": "https://github.com/evyatarmeged/Raccoon",
        "source": "https://github.com/evyatarmeged/Raccoon",
        "description": "Raccoon is an offensive security tool designed for reconnaissance and information gathering. It performs various tasks, including fetching DNS records, retrieving WHOIS information, obtaining TLS data, detecting WAF presence, threaded directory busting, and subdomain enumeration. Additionally, it supports subdomain enumeration, port scanning, service & banner grabbing, WHOIS & DNS lookups, web application scanning, OSINT, URL fuzzing, and directory & file detection.",
        "techniques": [
            "content_discovery",
            "enumeration",
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "fuzzing",
            "network_scanner",
            "OSINT",
            "port_scanner",
            "WAF_detection"
        ],
        "targets": [
            "cloud",
            "network",
            "web"
        ]
    },
    {
        "name": "Reaver",
        "url": "https://github.com/t6x/reaver-wps-fork-t6x",
        "source": "https://github.com/tiagob0b/Reaver-WPS",
        "description": "Reaver is a Wi-Fi hacking tool used to crack WPS (Wi-Fi Protected Setup) PINs and recover WPA/WPA2 passwords. It performs a brute force attack against Wifi Protected Setup (WPS) registrar PINs in order to recover WPA/WPA2 passphrases.",
        "techniques": [
            "password_attack"
        ],
        "categories": [],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "Recon-NG",
        "url": "https://github.com/lanmaster53/recon-ng",
        "source": "https://github.com/lanmaster53/recon-ng",
        "description": "Recon-ng is a full-featured reconnaissance framework designed for fast and thorough open-source web-based intelligence gathering. It is used for OSINT collection, DNS enumeration, domain and host discovery, WHOIS lookups, port scanning, attack surface mapping, etc.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "host_discovery",
            "network_scanner",
            "OSINT",
            "port_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "ReconDog",
        "url": "https://github.com/s0md3v/ReconDog",
        "source": "https://github.com/s0md3v/ReconDog",
        "description": "Reconnaissance Swiss Army Knife - uses APIs to gather information about a target system, including Censys, NS Lookup, Port Scanning, CMS Detection, WHOIS Lookup, Honeypot Detection, Subdomain Discovery, Reverse IP Lookup, and Technology Fingerprinting.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "network_scanner",
            "OSINT",
            "port_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "ReconFTW",
        "url": "https://github.com/lanmaster53/recon-ng",
        "source": "https://github.com/lanmaster53/recon-ng",
        "description": "ReconFTW is a tool designed to perform automated recon on a target domain by running the best set of tools to perform scanning and finding out vulnerabilities. It also performs various vulnerability checks like XSS, Open Redirects, SSRF, CRLF, LFI, SQLi, SSL tests, SSTI, DNS zone transfers, and much more. Along with these, it performs OSINT techniques, directory fuzzing, dorking, ports scanning, screenshots, nuclei scan on your target.",
        "techniques": [
            "enumeration",
            "reconnaissance",
            "vulnerability_assessment"
        ],
        "categories": [
            "fuzzing",
            "network_scanner",
            "OSINT",
            "subdomain_enum",
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Reqable",
        "url": "https://reqable.com/",
        "source": "https://github.com/reqable",
        "description": "Reqable is a modern cross-platform project, designed for API development, testing, and debugging. Reqable fully supports HTTP1 and HTTP2 and partially supports HTTP3(QUIC).",
        "techniques": [
            "HTTP_tampering"
        ],
        "categories": [],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Responder",
        "url": "https://github.com/lgandx/Responder",
        "source": "https://github.com/lgandx/Responder",
        "description": "Responder is a LLMNR, NBT-NS and MDNS poisoner, with built-in HTTP/SMB/MSSQL/FTP/LDAP rogue authentication server supporting NTLMv1/NTLMv2/LMv2, Extended Security NTLMSSP and Basic HTTP authentication.",
        "techniques": [
            "password_attack",
            "post_exploitation",
            "privilege_escalation"
        ],
        "categories": [
            "active_directory",
            "credential_dumping"
        ],
        "targets": [
            "windows"
        ]
    },
    {
        "name": "Retire.js",
        "url": "https://github.com/RetireJS/retire.js",
        "source": "https://github.com/RetireJS/retire.js",
        "description": "The scanner detects the use of JavaScript libraries with known vulnerabilities and can also generate an SBOM (Software Bill of Materials) for the libraries it identifies.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "extension",
            "javascript",
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Reverse Shell generator",
        "url": "https://revshells.com/",
        "source": "https://github.com/0dayCTF/reverse-shell-generator",
        "description": "Hosted Reverse Shell generator with a ton of functionality.",
        "techniques": [
            "exploitation",
            "privilege_escalation",
            "remote_code_execution"
        ],
        "categories": [
            "reverse_shell",
            "web_app"
        ],
        "targets": [
            "linux",
            "mac",
            "windows"
        ]
    },
    {
        "name": "RouterSploit",
        "url": "https://github.com/threat9/routersploit",
        "source": "https://github.com/threat9/routersploit",
        "description": "The RouterSploit Framework is an open-source exploitation framework dedicated to embedded devices.",
        "techniques": [
            "exploitation"
        ],
        "categories": [],
        "targets": [
            "IoT",
            "wireless"
        ]
    },
    {
        "name": "RustScan",
        "url": "https://github.com/RustScan/RustScan",
        "source": "https://github.com/RustScan/RustScan",
        "description": "A modern port scanner designed for high-speed scanning of open ports on target machines, featuring full scripting engine support. It can automatically pipe results into Nmap or utilize custom scripts for further analysis.",
        "techniques": [
            "enumeration"
        ],
        "categories": [
            "network_scanner",
            "port_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "S3Scanner",
        "url": "https://github.com/sa7mon/S3Scanner",
        "source": "https://github.com/sa7mon/S3Scanner",
        "description": "A tool for discovering open or misconfigured S3 buckets across AWS and other cloud providers using S3-compatible APIs.",
        "techniques": [
            "enumeration"
        ],
        "categories": [
            "misconfigs"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Scanlogd",
        "url": "https://www.openwall.com/scanlogd/",
        "source": "https://github.com/openwall/scanlogd",
        "description": "Scanlogd is a TCP port scan detection tool that monitors network traffic to detect and log TCP port scans. It helps identify potential reconnaissance activities by attackers who are scanning for open ports on a system.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "SeaShell",
        "url": "https://entysec.com/",
        "source": "https://github.com/EntySec/SeaShell",
        "description": "SeaShell Framework is an iOS post-exploitation framework developed by EntySec that enables you to access a device remotely, control it, and extract sensitive information. The attacker generates an IPA file, and starts a TCP listener. The IPA needs to be installed through TrollStore or another app that exploits a similar CoreTrust bug and launched to execute the payload. The attacker will then receive an interactive session with the device. Its default payload is Pwny, with features including evasion, TLS encryption, and dynamic extensions.",
        "techniques": [
            "exploitation",
            "hijacking",
            "post_exploitation",
            "remote_code_execution"
        ],
        "categories": [
            "RAT"
        ],
        "targets": [
            "iOS"
        ]
    },
    {
        "name": "SearchSploit",
        "url": "https://www.exploit-db.com/searchsploit",
        "source": "https://gitlab.com/exploit-database/exploitdb",
        "description": "SearchSploit is a command-line utility that enables users to search through the Exploit Database (Exploit-DB) for publicly available exploits and shellcode. It's particularly useful for penetration testers and security researchers who require access to exploit information, even in environments without internet connectivity.",
        "techniques": [
            "enumeration",
            "exploitation",
            "post_exploitation",
            "reconnaissance",
            "vulnerability_assessment"
        ],
        "categories": [
            "OSINT",
            "vulnerability_database"
        ],
        "targets": []
    },
    {
        "name": "SecLists",
        "url": "https://www.exploit-db.com/searchsploit",
        "source": "https://gitlab.com/exploit-database/exploitdb",
        "description": "SecLists is the security tester's companion. It's a collection of multiple types of lists used during security assessments, collected in one place. List types include usernames, passwords, URLs, sensitive data patterns, fuzzing payloads, web shells, and many more.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "fuzzing",
            "payload",
            "wordlists"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "SecretFinder",
        "url": "https://github.com/m4ll0k/SecretFinder",
        "source": "https://github.com/m4ll0k/SecretFinder",
        "description": "A python script for find sensitive data (apikeys, accesstoken,jwt,..) and search anything on javascript files,",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "extension",
            "fingerprinting",
            "javascript",
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Security Headers",
        "url": "https://securityheaders.com/",
        "source": "https://gitlab.com/exploit-database/exploitdb",
        "description": "SecurityHeaders.com scans a website's HTTP response headers to determine if they include key security features that protect against various attacks, such as Cross-Site Scripting (XSS), Clickjacking, and data injection. The tool then provides a grade (A+ to F) based on the presence and configuration of these headers.",
        "techniques": [
            "reconnaissance",
            "enumeration"
        ],
        "categories": [
            "header_analysis",
            "web_app"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Shcheck",
        "url": "https://sherlockproject.xyz/",
        "source": "https://github.com/sherlock-project/sherlock",
        "description": "Hunt down social media accounts by username across social networks.",
        "techniques": [
            "footprinting",
            "social_engineering"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "SHCheck",
        "url": "https://github.com/santoru/shcheck",
        "source": "https://github.com/santoru/shcheck",
        "description": "Security Header Checker (shcheck) is a simple tool to check the security headers of a website.",
        "techniques": [
            "reconnaissance",
            "enumeration"
        ],
        "categories": [
            "header_analysis"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "SHODAN",
        "url": "https://www.shodan.io",
        "source": "https://www.shodan.io",
        "description": "A search engine designed to detect internet-connected devices and networks with potential vulnerabilities.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT",
            "port_scanner",
            "search_engine",
            "web_app"
        ],
        "targets": [
            "IoT",
            "network"
        ]
    },
    {
        "name": "Sixo Online APK Analyzer",
        "url": "https://sisik.eu/apk-tool",
        "source": "https://sisik.eu/apk-tool",
        "description": "Sixo Online APK Analyzer is a tool that allows you to analyze various details of Android APK files. It can decompile binary XML files and resources.",
        "techniques": [
            "reverse_engineering"
        ],
        "categories": [
            "APK_analyzer"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "Skipfish",
        "url": "https://www.kali.org/tools/skipfish/",
        "source": "https://www.kali.org/tools/skipfish/",
        "description": "Skipfish is a web application security scanner developed by Google. It crawls and audits websites, looking for a wide range of vulnerabilities through active probing and fuzzing.",
        "techniques": [
            "vulnerability_assessment"
        ],
        "categories": [
            "fingerprinting",
            "vulnerability_scanner"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Social Searcher",
        "url": "https://www.social-searcher.com/",
        "source": "https://www.social-searcher.com/",
        "description": "Social Searcher - Free Social Media Search Engine",
        "techniques": [
            "social_engineering"
        ],
        "categories": [],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "SmartScanner",
        "url": "https://www.thesmartscanner.com/",
        "source": "https://www.thesmartscanner.com/",
        "description": "SmartScanner is an AI-powered web vulnerability scanner designed to enhance web application security testing. It automates the detection of various vulnerabilities, including those listed in the OWASP Top 10, such as SQL Injection (SQLi) and Cross-Site Scripting (XSS).",
        "techniques": [
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Smuggler",
        "url": "https://github.com/defparam/smuggler",
        "source": "https://github.com/defparam/smuggler",
        "description": "An HTTP Request Smuggling / Desync testing tool written in Python 3.",
        "techniques": [
            "HTTP_smuggling",
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Sn0int",
        "url": "https://sn0int.com/",
        "source": "https://github.com/kpcyrd/sn0int",
        "description": "Sn0int is a semi-automatic OSINT framework and package manager. It's used by IT security professionals, bug bounty hunters, law enforcement agencies and in security awareness trainings to gather intelligence about a given target or about yourself. sn0int is enumerating attack surface by semi-automatically processing public information and mapping the results in a unified format for followup investigations.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Sn1per",
        "url": "https://sn1persecurity.com/wordpress/",
        "source": "https://github.com/1N3/Sn1per",
        "description": "Sn1per is an automated penetration testing tool for reconnaissance, vulnerability scanning, and web security assessment. It gathers subdomains, WHOIS data, DNS details, and other OSINT while scanning for vulnerabilities using tools like Nmap, Nikto, and OpenVAS. It detects web application threats such as SQL injection and XSS, performs brute-force attacks on SSH and FTP, and identifies open ports and running services.",
        "techniques": [
            "enumeration",
            "reconnaissance",
            "vulnerability_assessment"
        ],
        "categories": [
            "network_scanner",
            "OSINT",
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "SNMP-Check",
        "url": "https://www.net-snmp.org/",
        "source": "https://github.com/net-snmp/net-snmp/",
        "description": "SNMP-Check is a command-line tool used for enumerating SNMP-enabled devices, gathering valuable network information from routers, switches, servers, and other SNMP-supported devices by querying them using SNMP protocols. It can extract system information such as OS details, uptime, hostname, and contact info, as well as list network interfaces, including IP and MAC addresses. Additionally, it retrieves installed software, identifies running processes and services, maps open ports, and detects available network services. SNMP-Check also supports SNMP community strings like public and private for access, making it a powerful tool for security assessments and network auditing.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "SNOW",
        "url": "https://darkside.com.au/snow/",
        "source": "https://darkside.com.au/snow/",
        "description": "The program SNOW is used to conceal messages in ASCII text by appending whitespace to the end of lines. Because spaces and tabs are generally not visible in text viewers, the message is effectively hidden from casual observers. And if the built-in encryption is used, the message cannot be read even if it is detected.",
        "techniques": [
            "steganography"
        ],
        "categories": [
            "exfiltration",
            "evasion"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "Social-Engineer Toolkit (SET)",
        "url": "https://www.trustedsec.com/",
        "source": "https://github.com/trustedsec/social-engineer-toolkit",
        "description": "The Social-Engineer Toolkit is an open-source penetration testing framework designed for social engineering.",
        "techniques": [
            "phishing",
            "social_engineering"
        ],
        "categories": [],
        "targets": [
            "people",
            "web"
        ]
    },
    {
        "name": "Sparrow WiFi",
        "url": "https://github.com/ghostop14/sparrow-wifi",
        "source": "https://github.com/ghostop14/sparrow-wifi",
        "description": "Sparrow-wifi is an advanced graphical Wi-Fi and Bluetooth analyzer designed specifically for Linux systems. Developed as a next-generation tool for 2.4 GHz and 5 GHz Wi-Fi spectral awareness, it offers a comprehensive GUI-based alternative to tools like inSSIDer and LinSSID.",
        "techniques": [
            "footprinting"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "SpiderFoot",
        "url": "http://www.spiderfoot.net/",
        "source": "https://github.com/smicallef/spiderfoot",
        "description": "SpiderFoot is an open source intelligence (OSINT) automation tool. It integrates with just about every data source available and utilises a range of methods for data analysis, making that data easy to navigate.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network"
        ]
    },
    {
        "name": "SpoofCheck",
        "url": "https://github.com/a6avind/spoofcheck",
        "source": "https://github.com/a6avind/spoofcheck",
        "description": "A Python tool to check if a domain can be spoofed by analyzing its SPF and DMARC records.",
        "techniques": [
            "spoofing"
        ],
        "categories": [
            "misconfigs",
            "email"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Spray365",
        "url": "https://github.com/MarkoH17/Spray365",
        "source": "https://github.com/MarkoH17/Spray365",
        "description": "Spray365 makes spraying Microsoft accounts (Office 365 / Azure AD) easy through its customizable two-step password spraying approach. The built-in execution plan features options that attempt to bypass Azure Smart Lockout and insecure conditional access policies.",
        "techniques": [
            "password_attack"
        ],
        "categories": [],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "SQLiFinder",
        "url": "https://github.com/americo/sqlifinder",
        "source": "https://github.com/americo/sqlifinder",
        "description": "Sqlifinder is a tool with the function of detecting GET-based sql injection vulnerabilities in web applications using waybackurls, web crawlers and sql injection payloads.",
        "techniques": [
            "SQL_injection",
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "database",
            "network",
            "web"
        ]
    },
    {
        "name": "SQLMap",
        "url": "https://sqlmap.org/",
        "source": "https://github.com/sqlmapproject/sqlmap",
        "description": "sqlmap is an open source penetration testing tool that automates the process of detecting and exploiting SQL injection flaws and taking over of database servers.",
        "techniques": [
            "exploitation",
            "SQL_injection",
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "database",
            "network",
            "web"
        ]
    },
    {
        "name": "SSLscan",
        "url": "https://github.com/rbsec/sslscan",
        "source": "https://github.com/rbsec/sslscan",
        "description": "SSLscan is a command-line SSL/TLS scanner used to test a server’s supported protocols, cipher suites, and certificate details.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "SSL_check"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "SSLTest",
        "url": "https://www.ssllabs.com/ssltest/",
        "source": "https://www.ssllabs.com/ssltest/",
        "description": "This free online service performs a deep analysis of the configuration of any SSL web server on the public Internet.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "SSL_check"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "SSLyze",
        "url": "https://github.com/nabla-c0d3/sslyze",
        "source": "https://github.com/nabla-c0d3/sslyze",
        "description": "SSLyze is a fast and powerful SSL/TLS scanner used by security professionals and system administrators to analyze the SSL configuration of a server.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "SSL_check"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Steghide",
        "url": "https://steghide.sourceforge.net/",
        "source": "http://sourceforge.net/projects/steghide/",
        "description": "Steghide is a steganography program that is able to hide data in various kinds of image- and audio-files. The color- respectivly sample-frequencies are not changed thus making the embedding resistant against first-order statistical tests.",
        "techniques": [
            "forensics",
            "steganography"
        ],
        "categories": [
            "exfiltration",
            "evasion"
        ],
        "targets": [
            "files"
        ]
    },
    {
        "name": "StormBreaker",
        "url": "https://github.com/ultrasecurity/Storm-Breaker",
        "source": "https://github.com/ultrasecurity/Storm-Breaker",
        "description": "Storm-Breaker is a social engineering tool that allows access to a target's webcam, microphone, and location using Python, JavaScript, and PHP. It can obtain device information without requiring explicit permission, access location data specifically from smartphones, and remotely control the webcam and microphone.",
        "techniques": [
            "hijacking",
            "phishing",
            "social_engineering"
        ],
        "categories": [],
        "targets": [
            "android",
            "hardware",
            "IoT",
            "people"
        ]
    },
    {
        "name": "Stratus Red Team",
        "url": "https://stratus-red-team.cloud/",
        "source": "https://github.com/DataDog/stratus-red-team",
        "description": "Stratus Red Team is 'Atomic Red Team' for the cloud, allowing to emulate offensive attack techniques in a granular and self-contained manner.",
        "techniques": [
            "enumeration",
            "exploitation",
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "Subfinder",
        "url": "https://projectdiscovery.io/",
        "source": "https://github.com/projectdiscovery/subfinder",
        "description": "Subfinder is a subdomain discovery tool that returns valid subdomains for websites, using passive online sources.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT",
            "subdomain_enum"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Subjs",
        "url": "https://github.com/lc/subjs",
        "source": "https://github.com/lc/subjs",
        "description": "Fetches javascript file from a list of URLS or subdomains.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "javascript",
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Sublist3r",
        "url": "https://github.com/aboul3la/Sublist3r",
        "source": "https://github.com/aboul3la/Sublist3r",
        "description": "Sublist3r is a python tool designed to enumerate subdomains of websites using OSINT.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT",
            "subdomain_enum"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "SX",
        "url": "https://github.com/v-byte-cpu/sx",
        "source": "https://github.com/v-byte-cpu/sx",
        "description": "SX is a command-line network scanner that performs ARP, TCP, and UDP scans to discover open ports. It utilizes an ARP cache mechanism for efficient scanning and provides JSON output for easy parsing.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Sysinternals",
        "url": "https://learn.microsoft.com/en-us/sysinternals/",
        "source": "https://learn.microsoft.com/en-us/sysinternals/",
        "description": "Sysinternals is a suite of powerful Windows utilities widely used in cybersecurity and system diagnostics. Many of the tools are free, with some offering access to source code. Popular tools include RootkitRevealer, which detects hidden registry and file system anomalies indicative of rootkits; Process Explorer, an advanced Task Manager that reveals detailed process information and helps audit permissions; and Autoruns, which displays all executables set to run at startup, a common place for malware to hide. TCPView allows users to monitor real-time network connections, while Procmon (Process Monitor) captures file system, registry, and process activity crucial for malware analysis. Tools like Strings and Sigcheck assist in analyzing binaries and verifying digital signatures. For offline analysis, Disk2vhd creates virtual disk images of live systems, and PsTools provides command-line capabilities for managing processes locally and remotely.",
        "techniques": [
            "enumeration",
            "malware_analysis",
            "sniffing"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "windows"
        ]
    },
    {
        "name": "TCPDump",
        "url": "https://www.tcpdump.org/",
        "source": "https://github.com/the-tcpdump-group",
        "description": "TCP dump is packet analyser tool used to capture and analyse packets and network traffic in real-time over network.",
        "techniques": [
            "sniffing"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Telnet",
        "url": "https://www.telnet.org/",
        "source": "https://www.telnet.org/",
        "description": "Telnet is a network protocol used to provide a command-line interface for remote access to another computer over a TCP/IP network. It allows users to log into a remote system and execute commands as if they were physically present at the machine.",
        "techniques": [
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Termux-ADB",
        "url": "https://github.com/nohajc/termux-adb",
        "source": "https://github.com/nohajc/termux-adb",
        "description": "Run adb and fastboot in Termux without root permissions.",
        "techniques": [
            "privilege_escalation"
        ],
        "categories": [
            "ADB"
        ],
        "targets": [
            "android"
        ]
    },
    {
        "name": "TestDisk",
        "url": "https://www.cgsecurity.org/",
        "source": "https://www.cgsecurity.org/wiki/TestDisk",
        "description": "TestDisk is an open-source data recovery software and digital forensics tool designed to recover lost partitions, fix boot issues, and restore deleted files.",
        "techniques": [
            "forensics"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "files",
            "hardware"
        ]
    },
    {
        "name": "TestSSL",
        "url": "https://github.com/testssl/testssl.sh",
        "source": "https://github.com/testssl/testssl.sh",
        "description": "Testssl.sh is a free command line tool which checks a server's service on any port for the support of TLS/SSL ciphers, protocols as well as some cryptographic flaws.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "SSL_check"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "The Sleuth Kit",
        "url": "https://www.sleuthkit.org/sleuthkit/",
        "source": "https://www.sleuthkit.org/sleuthkit/",
        "description": "The Sleuth Kit (TSK) is a library and collection of command line tools that allow you to investigate disk images. The core functionality of TSK allows you to analyze volume and file system data. The library can be incorporated into larger digital forensics tools and the command line tools can be directly used to find evidence.",
        "techniques": [
            "forensics"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "files",
            "hardware"
        ]
    },
    {
        "name": "theHarvester",
        "url": "https://www.edge-security.com/",
        "source": "https://github.com/laramies/theHarvester",
        "description": "OSINT gathering tool (collects names, emails, IP addresses, subdomains, and URLs using multiple public resources).",
        "techniques": [
            "enumeration",
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT"
        ],
        "targets": [
            "network",
            "people",
            "web"
        ]
    },
    {
        "name": "Tracee",
        "url": "https://aquasecurity.github.io/tracee/",
        "source": "https://github.com/aquasecurity/tracee",
        "description": "Tracee is a runtime security and observability tool that helps you understand how your system and applications behave. It is using eBPF technology to tap into your system and expose that information as events that you can consume.",
        "techniques": [
            "forensics"
        ],
        "categories": [],
        "targets": [
            "cloud",
            "linux"
        ]
    },
    {
        "name": "Trape",
        "url": "https://github.com/jofpin/trape",
        "source": "https://github.com/jofpin/trape",
        "description": "People tracker on the Internet: Learn to track the world, to avoid being traced.",
        "techniques": [
            "footprinting",
            "phishing",
            "social_engineering"
        ],
        "categories": [
            "OSINT",
            "tracker"
        ],
        "targets": [
            "people"
        ]
    },
    {
        "name": "Trivy",
        "url": "https://trivy.dev/",
        "source": "https://github.com/aquasecurity/trivy",
        "description": "Trivy is a comprehensive and versatile security scanner that analyzes a variety of targets—including container images, filesystems, remote Git repositories, virtual machine images, and Kubernetes environments—to identify potential security issues. It employs multiple scanners to detect OS packages and software dependencies (SBOM), known vulnerabilities (CVEs), infrastructure-as-code (IaC) misconfigurations, sensitive information and secrets, and software license details.",
        "techniques": [
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "cloud"
        ]
    },
    {
        "name": "TruffleHog",
        "url": "https://trufflesecurity.com/",
        "source": "https://github.com/trufflesecurity/trufflehog",
        "description": "TruffleHog is the most powerful secrets Discovery, Classification, Validation, and Analysis tool. In this context, secret refers to a credential a machine uses to authenticate itself to another machine. This includes API keys, database passwords, private encryption keys, and more.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "javascript"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Turbolist3r",
        "url": "https://github.com/fleetcaptain/Turbolist3r",
        "source": "https://github.com/fleetcaptain/Turbolist3r",
        "description": "Turbolist3r is a fork of the sublist3r subdomain discovery tool. In addition to the original OSINT capabilties of sublist3r, turbolist3r automates some analysis of the results, with a focus on subdomain takeover.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "OSINT",
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Uniscan",
        "url": "https://uniscan.sourceforge.io/",
        "source": "https://sourceforge.net/projects/uniscan/",
        "description": "Uniscan is a simple Remote File Include, Local File Include and Remote Command Execution vulnerability scanner.",
        "techniques": [
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "URL Extractor",
        "url": "https://urlextractor.net/",
        "source": "https://urlextractor.net/",
        "description": "This tool extracts URLs, meta tags, images, and email addresses from webpages and files, listing relevant information while navigating links to gather domains.",
        "techniques": [
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "URL Validation Bypass",
        "url": "https://portswigger.net/web-security/ssrf/url-validation-bypass-cheat-sheet",
        "source": "https://portswigger.net/web-security/ssrf/url-validation-bypass-cheat-sheet",
        "description": "This cheat sheet contains payloads for bypassing URL validation. These wordlists are useful for attacks such as server-side request forgery, CORS misconfigurations, and open redirection.",
        "techniques": [
            "exploitation"
        ],
        "categories": [
            "bypass",
            "web_app",
            "wordlists"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Urlscan.io",
        "url": "https://urlscan.io/",
        "source": "https://urlscan.io/",
        "description": "Urlscan.io is a free service to scan and analyse websites. When a URL is submitted to urlscan.io, an automated process will browse to the URL like a regular user and record the activity that this page navigation creates. This includes the domains and IPs contacted, the resources (JavaScript, CSS, etc) requested from those domains, as well as additional information about the page itself.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT",
            "web_app"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "VirusTotal",
        "url": "https://www.virustotal.com/",
        "source": "https://www.virustotal.com/",
        "description": "VirusTotal is a free online service that analyzes files, URLs, IPs, and domains for viruses, malware, and other kinds of malicious content using a combination of 70+ antivirus engines, sandboxing tools, and threat intelligence sources.",
        "techniques": [
            "forensics",
            "malware_analysis"
        ],
        "categories": [
            "OSINT",
            "web_app"
        ],
        "targets": [
            "files",
            "network",
            "web"
        ]
    },
    {
        "name": "Vulners.com",
        "url": "https://vulners.com/",
        "source": "https://vulners.com/",
        "description": "Vulners is an API-first vulnerability intelligence platform that aggregates data from over 200 diverse sources, including CVE databases, exploit repositories, vendor advisories, and bug bounty reports.",
        "techniques": [
            "reconnaissance",
            "vulnerability_assessment"
        ],
        "categories": [
            "OSINT",
            "vulnerability_database",
            "web_app"
        ],
        "targets": []
    },
    {
        "name": "W3af",
        "url": "https://docs.w3af.org/",
        "source": "https://docs.w3af.org/",
        "description": "W3af (Web Application Attack and Audit Framework) is an open-source web application security scanner designed to identify and exploit vulnerabilities in web applications. It is user-friendly, highly extensible, and includes dozens of plugins for web assessment and exploitation. In many ways, it functions like a web-focused version of Metasploit.",
        "techniques": [
            "exploitation",
            "SQL_injection",
            "vulnerability_assessment",
            "XSS"
        ],
        "categories": [
            "network_scanner",
            "vulnerability_scanner"
        ],
        "targets": [
            "web",
            "network"
        ]
    },
    {
        "name": "WAFW00F",
        "url": "https://www.enablesecurity.com/",
        "source": "https://github.com/EnableSecurity/wafw00f",
        "description": "WAFW00F allows one to identify and fingerprint Web Application Firewall (WAF) products protecting a website.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "WAF_detection"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Wapiti",
        "url": "https://wapiti-scanner.github.io/",
        "source": "https://github.com/wapiti-scanner/wapiti",
        "description": "Wapiti is an open-source web vulnerability scanner that audits web application security through black-box testing. It scans by crawling web pages and injecting payloads to detect vulnerabilities. After gathering URLs, forms, and inputs, Wapiti acts as a fuzzer, injecting payloads to test for vulnerabilities such as SQL Injection (SQLi), Cross-Site Scripting (XSS), File Inclusion, Command Execution, and SSRF.",
        "techniques": [
            "vulnerability_assessment"
        ],
        "categories": [
            "fuzzing",
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Wappalyzer",
        "url": "https://www.wappalyzer.com/lookup/",
        "source": "https://www.wappalyzer.com/",
        "description": "Instantly reveal the technology stack of any website, such as CMS, ecommerce platform or payment processor, as well as company and contact details.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "extension",
            "fingerprinting",
            "OSINT",
            "web_app"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Wash",
        "url": "https://github.com/t6x/reaver-wps-fork-t6x",
        "source": "https://github.com/tiagob0b/Reaver-WPS",
        "description": "Wash is a tool used alongside Reaver to identify WPS-enabled networks before launching an attack. It helps filter out networks that are vulnerable to WPS brute-force attacks by scanning nearby Wi-Fi networks and checking if WPS is enabled. Additionally, Wash determines whether a router is protected against Reaver attacks (e.g., if WPS Lockout is enabled) and displays essential details such as BSSID (MAC address), channel, and WPS version.",
        "techniques": [],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "Wayback Machine",
        "url": "https://web.archive.org/",
        "source": "https://web.archive.org/",
        "description": "The Wayback Machine - Internet’s Time Machine (part of Internet Archive) is a web archiving tool that stores historical snapshots of websites. It allows users to view old versions of web pages, even if they have been deleted or modified.",
        "techniques": [
            "forensics",
            "footprinting",
            "reconnaissance",
            "social_engineering"
        ],
        "categories": [
            "OSINT",
            "search_engine",
            "web_archive"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "WaybackURLs",
        "url": "https://github.com/tomnomnom/waybackurls",
        "source": "https://github.com/tomnomnom/waybackurls",
        "description": "Accept line-delimited domains on stdin, fetch known URLs from the Wayback Machine for *.domain and output them on stdout.",
        "techniques": [
            "content_discovery",
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "OSINT",
            "web_archive"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "WayMore",
        "url": "https://github.com/xnl-h4ck3r/waymore",
        "source": "https://github.com/xnl-h4ck3r/waymore",
        "description": "Find way more from the Wayback Machine, Common Crawl, Alien Vault OTX, URLScan, VirusTotal & Intelligence X.",
        "techniques": [
            "content_discovery",
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "OSINT",
            "web_archive"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "WepCrackGUI",
        "url": "https://wepcrackgui.sourceforge.io/",
        "source": "https://sourceforge.net/projects/wepcrackgui/",
        "description": "A GUI for Aircrack-ng that can crack WEP and WPA networks, automatically scans for available networks, and provides fake authentication and injection support. Features include cracking WEP and WPA-encrypted networks, support for multiple interfaces, network scanning, packet injection, fake authentication (Open and Shared key), MAC address changer, hidden SSID discovery, WEP dictionary attack, and a password generator for WPA networks.",
        "techniques": [],
        "categories": [
            "rogue_access_point"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "WES-NG",
        "url": "https://wepcrackgui.sourceforge.io/",
        "source": "https://sourceforge.net/projects/wepcrackgui/",
        "description": "WES-NG (Windows Exploit Suggester - Next Generation) is a tool based on the output of Windows' systeminfo utility which provides the list of vulnerabilities the OS is vulnerable to, including any exploits for these vulnerabilities. Every Windows OS between Windows XP and Windows 11, including their Windows Server counterparts, is supported.",
        "techniques": [
            "exploitation",
            "privilege_escalation",
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "windows"
        ]
    },
    {
        "name": "Weevely",
        "url": "https://github.com/epinna/weevely3",
        "source": "https://github.com/epinna/weevely3",
        "description": "Weevely is a web shell designed for post-exploitation purposes that can be extended over the network at runtime.",
        "techniques": [
            "post_exploitation"
        ],
        "categories": [
            "reverse_shell"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "Wifite",
        "url": "https://github.com/kimocoder/wifite2",
        "source": "https://github.com/derv82/wifite2",
        "description": "Wifite is an automated wireless auditing tool designed for penetration testers and ethical hackers, using all known methods to retrieve the password of a wireless access point. It simplifies WiFi attacks by automating WEP, WPA, and WPA2 cracking techniques with tools like Aircrack-ng, Reaver, and Bully. Wifite is particularly useful for Evil Twin, WPS, and handshake capture attacks with minimal user input. Key features include automated WiFi hacking, WPA/WPA2 handshake capture, WPS attacks, Evil Twin attack, deauthentication attack, hidden SSID discovery, WiFi signal jammer, block specific accesspoints or multiple, and support for multiple WiFi adapters.",
        "techniques": [],
        "categories": [
            "credential_dumping",
            "network_scanner",
            "rogue_access_point"
        ],
        "targets": [
            "network",
            "wireless"
        ]
    },
    {
        "name": "Wireshark",
        "url": "https://www.wireshark.org/",
        "source": "https://gitlab.com/wireshark/wireshark",
        "description": "Wireshark is a open-source network protocol analyzer that interactively captures and analyzes network traffic in real time.",
        "techniques": [
            "sniffing"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "WhatWaf",
        "url": "https://github.com/Ekultek/WhatWaf",
        "source": "https://github.com/Ekultek/WhatWaf",
        "description": "Detect and bypass web application firewalls and protection systems.",
        "techniques": [
            "reconnaissance"
        ],
        "categories": [
            "bypass",
            "WAF_detection"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "WhatWeb",
        "url": "https://morningstarsecurity.com/",
        "source": "https://github.com/urbanadventurer/WhatWeb",
        "description": "Next generation web scanner - WhatWeb is an open-source web reconnaissance tool used to fingerprint and analyze websites by detecting technologies, frameworks, CMS (like WordPress), and security vulnerabilities.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fingerprinting",
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Whois",
        "url": "https://github.com/rfc1036/whois",
        "source": "https://github.com/rfc1036/whois",
        "description": "Retrieve WHOIS information or records for a domain.",
        "techniques": [
            "enumeration",
            "footprinting",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT"
        ],
        "targets": [
            "network"
        ]
    },
    {
        "name": "Wi-Fi Scanner",
        "url": "https://lizardsystems.com/wi-fi-scanner/",
        "source": "https://lizardsystems.com/wi-fi-scanner/",
        "description": "Wi-Fi Scanner is a Wi-Fi network analysis tool designed to help users find and troubleshoot wireless networks. It provides detailed information about nearby Wi-Fi networks, including the network name (SSID), signal strength (RSSI) and quality, MAC address (BSSID), channel, maximum and achievable data rates, security settings, channel usage, and bandwidth.",
        "techniques": [
            "footprinting"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "WiFi Analyzer",
        "url": "https://vremsoftwaredevelopment.github.io/WiFiAnalyzer/",
        "source": "https://github.com/VREMSoftwareDevelopment/WiFiAnalyzer",
        "description": "WiFi Analyzer is a free, open-source Wi-Fi analysis tool available for Android devices. It helps users optimize their Wi-Fi networks by providing detailed insights into signal strength, channel usage, and interference. Key features include real-time signal strength monitoring, SSID & BSSID information, and more.",
        "techniques": [
            "footprinting"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "hardware",
            "IoT",
            "wireless"
        ]
    },
    {
        "name": "Wifiphisher",
        "url": "https://wifiphisher.org/",
        "source": "https://github.com/wifiphisher/wifiphisher",
        "description": "Wifiphisher is a rogue access point framework designed for red team engagements and Wi-Fi security testing. It allows penetration testers to achieve a man-in-the-middle position against wireless clients by performing targeted Wi-Fi association attacks. Wifiphisher can also be used for victim-customized web phishing attacks, capturing credentials from third-party login pages or WPA/WPA2 Pre-Shared Keys, and even infecting victim devices with malware. Key features include Evil Twin attacks, Deauthentication attacks, Captive Portal Phishing, Payload Injection, Multiple Attack Modes, and the ability to bypass password cracking.",
        "techniques": [
            "exploitation",
            "phishing",
            "social_engineering"
        ],
        "categories": [
            "credential_dumping",
            "rogue_access_point"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network"
        ]
    },
    {
        "name": "WiFiman",
        "url": "https://www.ui.com/download",
        "source": "https://www.ui.com/download",
        "description": "WiFiman is a Wi-Fi and network analysis tool developed by Ubiquiti Inc. It helps users scan Wi-Fi networks, analyze signal strength, detect interference, and test internet speed.",
        "techniques": [
            "footprinting"
        ],
        "categories": [
            "network_scanner"
        ],
        "targets": [
            "hardware",
            "IoT",
            "network",
            "wireless"
        ]
    },
    {
        "name": "Wfuzz",
        "url": "https://www.wfuzz.io/",
        "source": "https://github.com/xmendez/wfuzz",
        "description": "WFuzz is a web application security tool designed for brute-forcing web applications to discover hidden files, directories, parameters, and vulnerabilities. It's primarily used for fuzzing (i.e., testing web applications by sending various payloads).",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "fuzzing"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "WPScan",
        "url": "https://wpscan.com/",
        "source": "https://github.com/wpscanteam/wpscan/",
        "description": "WPScan WordPress security scanner. Written for security professionals and blog maintainers to test the security of their WordPress websites.",
        "techniques": [
            "vulnerability_assessment"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "xnLinkFinder",
        "url": "https://github.com/xnl-h4ck3r/xnLinkFinder",
        "source": "https://github.com/xnl-h4ck3r/xnLinkFinder",
        "description": "A python tool used to discover endpoints, potential parameters, and a target specific wordlist for a given target.",
        "techniques": [
            "content_discovery",
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "OSINT"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "XSSer",
        "url": "https://xsser.03c8.net/",
        "source": "https://code.03c8.net/epsylon/xsser",
        "description": "Cross-Site Scripter (aka XSSer) is an automated penetration testing tool designed to detect, exploit, and report Cross-Site Scripting (XSS) vulnerabilities in web applications. It supports automated scanning for XSS vulnerabilities, multiple types of XSS attacks, the ability to generate and obfuscate payloads, and integration with Tor for anonymous testing.",
        "techniques": [
            "exploitation",
            "vulnerability_assessment",
            "XSS"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "XSStrike",
        "url": "https://github.com/s0md3v/XSStrike",
        "source": "https://github.com/s0md3v/XSStrike",
        "description": "XSStrike is a Cross Site Scripting detection suite equipped with four hand written parsers, an intelligent payload generator, a powerful fuzzing engine and an incredibly fast crawler.",
        "techniques": [
            "exploitation",
            "vulnerability_assessment",
            "XSS"
        ],
        "categories": [
            "vulnerability_scanner"
        ],
        "targets": [
            "web"
        ]
    },
    {
        "name": "Zed Attack Proxy (ZAP)",
        "url": "https://www.zaproxy.org/",
        "source": "https://github.com/zaproxy",
        "description": "ZAP (Zed Attack Proxy), or ZAP Proxy, is an open-source security tool used to identify vulnerabilities in web applications. It is developed and maintained by the OWASP community. ZAP is used for web application security testing, API penetration testing, and automated vulnerability scanning.",
        "techniques": [
            "HTTP_tampering",
            "vulnerability_assessment"
        ],
        "categories": [
            "fuzzing",
            "vulnerability_scanner"
        ],
        "targets": [
            "network",
            "web"
        ]
    },
    {
        "name": "ZipCrack",
        "url": "https://github.com/henriksb/ZipCrack",
        "source": "https://github.com/henriksb/ZipCrack",
        "description": "ZipCrack is a command-line tool to crack password protected Zip files without using separate programs like 7zip or Winrar to extract, which makes it a great deal faster. ZipCracker supports brute force and dictionary attack.",
        "techniques": [
            "password_attack"
        ],
        "categories": [],
        "targets": [
            "files"
        ]
    },
    {
        "name": "Zoomeye",
        "url": "https://www.zoomeye.ai/",
        "source": "https://www.zoomeye.ai/",
        "description": "ZoomEyeis an advanced cyberspace search engine developed and maintained by KnownSec Hong Kong. As a leader in the field of cybersecurity, ZoomEye is dedicated to mapping the global cyberspace, offering in-depth search capabilities for devices connected to the internet, such as routers, servers, and webcams. Leveraging unique technology and an extensive network of surveying nodes, ZoomEye can scan global IPv4 and IPv6 addresses as well as website domain names, identifying and analyzing a wide range of service ports and protocols.",
        "techniques": [
            "enumeration",
            "reconnaissance"
        ],
        "categories": [
            "network_scanner",
            "OSINT",
            "search_engine"
        ],
        "targets": [
            "network",
            "web"
        ]
    }
]